atrip.org
#+title: ATRIP: An MPI-asynchronous implementation of CCSD(T)
#+PROPERTY: header-args+ :noweb yes :comments noweb :mkdirp t

* Implementation

The algorithm uses two main data types, the =Slice= and the
=SliceUnion= as a container and resource manager of the =Slice=.

** The slice

The following section introduces the idea of a slice.

*** Prolog                                                         :noexport:
#+begin_src c++ :tangle (atrip-slice-h)
#pragma once
#include <iostream>
#include <algorithm>
#include <vector>
#include <mpi.h>

#include <atrip/Tuples.hpp>
#include <atrip/Utils.hpp>

namespace atrip {


struct Slice {

  using F = double;
#+end_src
*** Introduction

A slice is the concept of a subset of values of a given tensor.
As an example, for the doubles amplitudes \( T^{ab}_{ij} \), one need two kinds of objects:
- the object \( \mathsf{T}(a)^b_{ij} \) which for every \( a \) gets assigned the
  tensor \( T^{ab}_{ij} \) of size \( N_\mathrm{o}^2 \times N_\mathrm{v} \)

- the object \( \mathsf{T}(a,b)_{ij} \) which for every pair of \( a, b \)
  corresponds the \( N_\mathrm{o}^2 \)-sized tensor \( T^{ab}_{ij} \).

*** Location

Every slice set, for instance,
\( S_k = \left\{
    a \mapsto \mathsf{T}(a)^{b}_{ij}
    \mid
    a \in A_k
\right\} \)
where \( A_k \) is some subset of
\( \mathsf{N}_\mathrm{v} \),
gets stored in some rank \( k \).
In general however, the number of elements in \( A_k \) can be bigger
than the number of processes \( n_p \). Therefore in order to uniquely
indentify a given slice in \( S_k \) we need two identifiers,
the rank \( k \), which tells us in which core's memory the slice is
allocated, and an additional tag which we will call =source=.

The datatype that simply models this state of affairs
is therefore a simple structure:

#+begin_src c++ :tangle (atrip-slice-h)
  struct Location { size_t rank; size_t source; };
#+end_src

*** Type

Due to the permutation operators in the equations
it is noticeable that for every one dimensional
slice and triple \( (a,b,c) \)
\begin{equation*}
a \mapsto \mathsf{t}(a)
\end{equation*}
one needs at the same time
\( \mathsf{t}(a) \),
\( \mathsf{t}(b) \) and
\( \mathsf{t}(c) \).
For two dimensional slices, i.e., slices of the form
\begin{equation*}
(a,b) \mapsto \mathsf{t}(a,b)
\end{equation*}
one needs in the equations the slices
\( \mathsf{t}(a,b) \),
\( \mathsf{t}(b,c) \) and
\( \mathsf{t}(a,c) \).
In addition, in the case of diagrams where
the integral \( V^{ab}_{ci} \) appears,
we additionaly need the permuted slices
from before, i.e.
\( \mathsf{t}(b,a) \),
\( \mathsf{t}(c,b) \) and
\( \mathsf{t}(c,a) \).

This means, every slice has associated with it
a type which denotes which permutation it is.


#+begin_src c++ :tangle (atrip-slice-h)
  enum Type
    { A = 10
    , B
    , C
    // Two-parameter slices
    , AB = 20
    , BC
    , AC
    // for abci and the doubles
    , CB
    , BA
    , CA
    // The non-typed slice
    , Blank = 404
    };
#+end_src

*** State

Every slice can be in different states and every state
denotes which function the slice is going to provide
and which relations they have between themselves.

- Fetch ::
  A slice is in state =Fetch= when it
  has a valid data pointer that **must** be written to.
  A =Fetch= slice should not live very long, this means
  that after the database send and receive phase,
  =Fetch= slices should be changed into =Dispatched=
  in order to start the process of writing to the
  data pointer from some other rank.
- Dispatched ::
  A =Dispatched= slice indicates that at some point
  send and receive MPI calls have been dispatched
  in order to get the data.
  However, the calls have just been dispatched and there
  is no warranty for the data to be there, for that,
  the slice must be unwrapped.
- Ready ::
  =Ready= means that the data pointer can be read from
  directly.
- SelfSufficient ::
  A slice is =SelfSufficient= when its contents are located
  in the same rank that it lives, so that it does not have to
  fetch from no other rank.
  This is important in order to handle the data pointers correctly
  and in order to save calls to MPI receive and send functions.
- Recycled ::
  =Recycled= means that this slice gets its data pointer from another
  slice, so it should not be written to
- Acceptor ::
  =Acceptor= means that the slice can accept a new slice, it is
  the counterpart of the =Blank= type, but for states

Again the implementation is a simple enum type.

#+begin_src c++ :tangle (atrip-slice-h)
  enum State {
    Fetch = 0,
    Dispatched = 2,
    Ready = 1,
    SelfSufficient = 911,
    Recycled = 123,
    Acceptor = 405
  };
#+end_src

