atrip.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-04 Fri 14:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ATRIP: An MPI-asynchronous implementation of CCSD(T)</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">ATRIP: An MPI-asynchronous implementation of CCSD(T)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6d627ce">1. Introduction</a></li>
<li><a href="#org46304a6">2. The slice</a>
<ul>
<li><a href="#org67bd9ec">2.1. Introduction</a></li>
<li><a href="#org5efc476">2.2. Location</a></li>
<li><a href="#org7c9334a">2.3. Type</a></li>
<li><a href="#orgbc4614e">2.4. State</a></li>
<li><a href="#org44df0df">2.5. The Info structure</a></li>
<li><a href="#org1d07efd">2.6. Name</a></li>
<li><a href="#orgee6ebb8">2.7. Database</a></li>
<li><a href="#org94991ba">2.8. MPI Types</a></li>
<li><a href="#orgb3c66c9">2.9. Static utilities</a></li>
<li><a href="#org99fcf28">2.10. Attributes</a></li>
<li><a href="#org23ab391">2.11. Member functions</a></li>
</ul>
</li>
<li><a href="#org7e59ffa">3. Utils</a>
<ul>
<li><a href="#org6819c29">3.1. Pretty printing</a></li>
<li><a href="#orgc27b6f2">3.2. Chrono</a></li>
</ul>
</li>
<li><a href="#org393169e">4. The rank mapping</a></li>
<li><a href="#org537d7e2">5. The slice union</a></li>
<li><a href="#org375c7fb">6. Tuples</a>
<ul>
<li><a href="#org3b4df16">6.1. Tuples types</a></li>
<li><a href="#orgc95eb8b">6.2. Distributing the tuples</a></li>
<li><a href="#org695308f">6.3. Node information</a></li>
<li><a href="#org1e569f8">6.4. Naive list</a></li>
<li><a href="#orgb60e8a6">6.5. Group and sort list</a>
<ul>
<li><a href="#orge92957a">6.5.1. Utils</a></li>
<li><a href="#org76a9e9b">6.5.2. Distribution</a></li>
<li><a href="#orge1a4493">6.5.3. Main</a></li>
<li><a href="#org2d25a54">6.5.4. Interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org41e273c">7. Unions</a></li>
<li><a href="#org22c472e">8. Equations</a></li>
<li><a href="#orgb82b3e5">9. Blas</a></li>
<li><a href="#orgfb92f75">10. Atrip</a>
<ul>
<li><a href="#org49512bb">10.1. Header</a></li>
<li><a href="#orgae5a8f5">10.2. Main</a></li>
</ul>
</li>
<li><a href="#org075d98e">11. Debug and Logging</a>
<ul>
<li><a href="#org75801bc">11.1. Macros</a></li>
<li><a href="#org7b3e8c7">11.2. Iteration informer</a></li>
</ul>
</li>
<li><a href="#org36ff30a">12. Include header</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6d627ce" class="outline-2">
<h2 id="org6d627ce"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The algorithm uses two main data types, the <code>Slice</code> and the
<code>SliceUnion</code> as a container and resource manager of the <code>Slice</code>.
</p>
</div>
</div>

<div id="outline-container-org46304a6" class="outline-2">
<h2 id="org46304a6"><span class="section-number-2">2</span> The slice</h2>
<div class="outline-text-2" id="text-2">
<p>
The following section introduces the idea of a slice.
</p>
</div>

<div id="outline-container-org67bd9ec" class="outline-3">
<h3 id="org67bd9ec"><span class="section-number-3">2.1</span> Introduction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A slice is the concept of a subset of values of a given tensor.
As an example, for the doubles amplitudes \( T^{ab}_{ij} \), one need two kinds of objects:
</p>
<ul class="org-ul">
<li>the object \( \mathsf{T}(a)^b_{ij} \) which for every \( a \) gets assigned the
tensor \( T^{ab}_{ij} \) of size \( N_\mathrm{o}^2 \times N_\mathrm{v} \)</li>

<li>the object \( \mathsf{T}(a,b)_{ij} \) which for every pair of \( a, b \)
corresponds the \( N_\mathrm{o}^2 \)-sized tensor \( T^{ab}_{ij} \).</li>
</ul>
</div>
</div>

<div id="outline-container-org5efc476" class="outline-3">
<h3 id="org5efc476"><span class="section-number-3">2.2</span> Location</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Every slice set, for instance,
\( S_k = \left\{
    a \mapsto \mathsf{T}(a)^{b}_{ij}
    \mid
    a \in A_k
\right\} \)
where \( A_k \) is some subset of
\( \mathsf{N}_\mathrm{v} \),
gets stored in some rank \( k \).
In general however, the number of elements in \( A_k \) can be bigger
than the number of processes \( n_p \). Therefore in order to uniquely
indentify a given slice in \( S_k \) we need two identifiers,
the rank \( k \), which tells us in which core's memory the slice is
allocated, and an additional tag which we will call <code>source</code>.
</p>

<p>
The datatype that simply models this state of affairs
is therefore a simple structure:
</p>

<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Location</span> { <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">rank</span>; <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">source</span>; };
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c9334a" class="outline-3">
<h3 id="org7c9334a"><span class="section-number-3">2.3</span> Type</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Due to the permutation operators in the equations
it is noticeable that for every one dimensional
slice and triple \( (a,b,c) \)
</p>
\begin{equation*}
a \mapsto \mathsf{t}(a)
\end{equation*}
<p>
one needs at the same time
\( \mathsf{t}(a) \),
\( \mathsf{t}(b) \) and
\( \mathsf{t}(c) \).
For two dimensional slices, i.e., slices of the form
</p>
\begin{equation*}
(a,b) \mapsto \mathsf{t}(a,b)
\end{equation*}
<p>
one needs in the equations the slices
\( \mathsf{t}(a,b) \),
\( \mathsf{t}(b,c) \) and
\( \mathsf{t}(a,c) \).
In addition, in the case of diagrams where
the integral \( V^{ab}_{ci} \) appears,
we additionaly need the permuted slices
from before, i.e.
\( \mathsf{t}(b,a) \),
\( \mathsf{t}(c,b) \) and
\( \mathsf{t}(c,a) \).
</p>

<p>
This means, every slice has associated with it
a type which denotes which permutation it is.
</p>


<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #a626a4;">enum</span> <span style="color: #c18401;">Type</span>
    { <span style="color: #8b4513;">A</span> = 10
    , <span style="color: #8b4513;">B</span>
    , <span style="color: #8b4513;">C</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Two-parameter slices</span>
    , <span style="color: #8b4513;">AB</span> = 20
    , <span style="color: #8b4513;">BC</span>
    , <span style="color: #8b4513;">AC</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">for abci and the doubles</span>
    , <span style="color: #8b4513;">CB</span>
    , <span style="color: #8b4513;">BA</span>
    , <span style="color: #8b4513;">CA</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">The non-typed slice</span>
    , <span style="color: #8b4513;">Blank</span> = 404
    };
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc4614e" class="outline-3">
<h3 id="orgbc4614e"><span class="section-number-3">2.4</span> State</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Every slice can be in different states and every state
denotes which function the slice is going to provide
and which relations they have between themselves.
</p>

<dl class="org-dl">
<dt>Fetch</dt><dd>A slice is in state <code>Fetch</code> when it
has a valid data pointer that <b><b>must</b></b> be written to.
A <code>Fetch</code> slice should not live very long, this means
that after the database send and receive phase,
<code>Fetch</code> slices should be changed into <code>Dispatched</code>
in order to start the process of writing to the
data pointer from some other rank.</dd>
<dt>Dispatched</dt><dd>A <code>Dispatched</code> slice indicates that at some point
send and receive MPI calls have been dispatched
in order to get the data.
However, the calls have just been dispatched and there
is no warranty for the data to be there, for that,
the slice must be unwrapped.</dd>
<dt>Ready</dt><dd><code>Ready</code> means that the data pointer can be read from
directly.</dd>
<dt>SelfSufficient</dt><dd>A slice is <code>SelfSufficient</code> when its contents are located
in the same rank that it lives, so that it does not have to
fetch from no other rank.
This is important in order to handle the data pointers correctly
and in order to save calls to MPI receive and send functions.</dd>
<dt>Recycled</dt><dd><code>Recycled</code> means that this slice gets its data pointer from another
slice, so it should not be written to</dd>
<dt>Acceptor</dt><dd><code>Acceptor</code> means that the slice can accept a new slice, it is
the counterpart of the <code>Blank</code> type, but for states</dd>
</dl>

<p>
Again the implementation is a simple enum type.
</p>

<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #a626a4;">enum</span> <span style="color: #c18401;">State</span> {
    <span style="color: #8b4513;">Fetch</span> = 0,
    <span style="color: #8b4513;">Dispatched</span> = 2,
    <span style="color: #8b4513;">Ready</span> = 1,
    <span style="color: #8b4513;">SelfSufficient</span> = 911,
    <span style="color: #8b4513;">Recycled</span> = 123,
    <span style="color: #8b4513;">Acceptor</span> = 405
  };
</pre>
</div>
</div>
</div>
