atrip.org
*** The Info structure

Every slice has an information structure associated with it
that keeps track of the **variable** type, state and so on.

#+begin_src c++ :tangle (atrip-slice-h)
struct Info {
  // which part of a,b,c the slice holds
  PartialTuple tuple;
  // The type of slice for the user to retrieve the correct one
  Type type;
  // What is the state of the slice
  State state;
  // Where the slice is to be retrieved
  Location from;
  // If the data are actually to be found in this other slice
  Type recycling;

  Info() : tuple{0,0}
          , type{Blank}
          , state{Acceptor}
          , from{0,0}
          , recycling{Blank}
          {}
};

using Ty_x_Tu = std::pair< Type, PartialTuple >;
#+end_src

*** Name

CCSD(T) needs in this algorithm 5 types of tensor slices,
namely
\( V^{ij}_{ka} \), \( V^{ab}_{ci} \),
\( V^{ab}_{ij} \)
and two times \( T^{ab}_{ij} \).
The reason why we need two times the doubles
amplitudes is because in the doubles contribution
to the energy, the \( T \) amplidutes will be sliced
through one parameter for the particle contribution
and through two parameters for the hole contribution.


#+begin_src c++ :tangle (atrip-slice-h)
  enum Name
    { TA    = 100
    , VIJKA = 101
    , VABCI = 200
    , TABIJ = 201
    , VABIJ = 202
    };
#+end_src

*** Database

The database is a simple representation of the slices of a slice union.
Every element of the database is given by the name of the tensor it
represents and the internal information structure.

#+begin_src c++ :tangle (atrip-slice-h)
  struct LocalDatabaseElement {
    Slice::Name name;
    Slice::Info info;
  };
#+end_src

A local database (of a given rank) and the global database is thus simply
a vector of these elements.

#+begin_src c++ :tangle (atrip-slice-h)
  using LocalDatabase = std::vector<LocalDatabaseElement>;
  using Database = LocalDatabase;
#+end_src

