atrip.html

<div id="outline-container-org44df0df" class="outline-3">
<h3 id="org44df0df"><span class="section-number-3">2.5</span> The Info structure</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Every slice has an information structure associated with it
that keeps track of the <b><b>variable</b></b> type, state and so on.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Info</span> {
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">which part of a,b,c the slice holds</span>
  <span style="color: #c18401;">PartialTuple</span> <span style="color: #8b4513;">tuple</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">The type of slice for the user to retrieve the correct one</span>
  <span style="color: #c18401;">Type</span> <span style="color: #8b4513;">type</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">What is the state of the slice</span>
  <span style="color: #c18401;">State</span> <span style="color: #8b4513;">state</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Where the slice is to be retrieved</span>
  <span style="color: #c18401;">Location</span> <span style="color: #8b4513;">from</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">If the data are actually to be found in this other slice</span>
  <span style="color: #c18401;">Type</span> <span style="color: #8b4513;">recycling</span>;

  <span style="color: #0184bc;">Info</span>() : tuple{0,0}
          , type{Blank}
          , state{Acceptor}
          , from{0,0}
          , recycling{Blank}
          {}
};

<span style="color: #a626a4;">using</span> <span style="color: #c18401;">Ty_x_Tu</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">pair</span>&lt; <span style="color: #c18401;">Type</span>, <span style="color: #c18401;">PartialTuple</span> &gt;;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d07efd" class="outline-3">
<h3 id="org1d07efd"><span class="section-number-3">2.6</span> Name</h3>
<div class="outline-text-3" id="text-2-6">
<p>
CCSD(T) needs in this algorithm 5 types of tensor slices,
namely
\( V^{ij}_{ka} \), \( V^{ab}_{ci} \),
\( V^{ab}_{ij} \)
and two times \( T^{ab}_{ij} \).
The reason why we need two times the doubles
amplitudes is because in the doubles contribution
to the energy, the \( T \) amplidutes will be sliced
through one parameter for the particle contribution
and through two parameters for the hole contribution.
</p>


<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #a626a4;">enum</span> <span style="color: #c18401;">Name</span>
    { <span style="color: #8b4513;">TA</span>    = 100
    , <span style="color: #8b4513;">VIJKA</span> = 101
    , <span style="color: #8b4513;">VABCI</span> = 200
    , <span style="color: #8b4513;">TABIJ</span> = 201
    , <span style="color: #8b4513;">VABIJ</span> = 202
    };
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee6ebb8" class="outline-3">
<h3 id="orgee6ebb8"><span class="section-number-3">2.7</span> Database</h3>
<div class="outline-text-3" id="text-2-7">
<p>
The database is a simple representation of the slices of a slice union.
Every element of the database is given by the name of the tensor it
represents and the internal information structure.
</p>

<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">LocalDatabaseElement</span> {
    <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Name</span> <span style="color: #8b4513;">name</span>;
    <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Info</span> <span style="color: #8b4513;">info</span>;
  };
</pre>
</div>

<p>
A local database (of a given rank) and the global database is thus simply
a vector of these elements.
</p>

<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #a626a4;">using</span> <span style="color: #c18401;">LocalDatabase</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;LocalDatabaseElement&gt;;
  <span style="color: #a626a4;">using</span> <span style="color: #c18401;">Database</span> = LocalDatabase;
</pre>
</div>
</div>
</div>
