atrip.html

<div id="outline-container-org94991ba" class="outline-3">
<h3 id="org94991ba"><span class="section-number-3">2.8</span> MPI Types</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">struct</span> <span style="color: #c18401;">mpi</span> {

  <span style="color: #a626a4;">static</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #0184bc;">vector</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">n</span>, <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">DT</span>) {
    <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">dt</span>;
    MPI_Type_vector(n, 1, 1, DT, &amp;dt);
    MPI_Type_commit(&amp;dt);
    <span style="color: #a626a4;">return</span> dt;
  }

  <span style="color: #a626a4;">static</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #0184bc;">sliceLocation</span> () {
    <span style="color: #a626a4;">constexpr</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">n</span> = 2;
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">create a sliceLocation to measure in the current architecture</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">the packing of the struct</span>
    <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Location</span> <span style="color: #8b4513;">measure</span>;
    <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">dt</span>;
    <span style="color: #a626a4;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int</span>&gt; <span style="color: #8b4513;">lengths</span>(n, 1);
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">types</span>[n] = {usizeDt(), usizeDt()};

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">measure the displacements in the struct</span>
    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span> = 0;
    <span style="color: #c18401;">MPI_Aint</span> <span style="color: #8b4513;">displacements</span>[n];
    MPI_Get_address(&amp;measure.rank,   &amp;displacements[j++]);
    MPI_Get_address(&amp;measure.source, &amp;displacements[j++]);
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 1; i &lt; n; i++) displacements[i] -= displacements[0];
    displacements[0] = 0;

    MPI_Type_create_struct(n, lengths.data(), displacements, types, &amp;dt);
    MPI_Type_commit(&amp;dt);
    <span style="color: #a626a4;">return</span> dt;
  }

  <span style="color: #a626a4;">static</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #0184bc;">enumDt</span>() { <span style="color: #a626a4;">return</span> MPI_INT; }
  <span style="color: #a626a4;">static</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #0184bc;">usizeDt</span>() { <span style="color: #a626a4;">return</span> MPI_UINT64_T; }

  <span style="color: #a626a4;">static</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #0184bc;">sliceInfo</span> () {
    <span style="color: #a626a4;">constexpr</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">n</span> = 5;
    <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">dt</span>;
    <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Info</span> <span style="color: #8b4513;">measure</span>;
    <span style="color: #a626a4;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int</span>&gt; <span style="color: #8b4513;">lengths</span>(n, 1);
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">types</span>[n]
      = { vector(2, <span style="color: #c18401;">usizeDt</span>())
        , enumDt()
        , enumDt()
        , sliceLocation()
        , enumDt()
        };

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">create the displacements from the info measurement struct</span>
    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span> = 0;
    <span style="color: #c18401;">MPI_Aint</span> <span style="color: #8b4513;">displacements</span>[n];
    MPI_Get_address(measure.tuple.data(), &amp;displacements[j++]);
    MPI_Get_address(&amp;measure.type,        &amp;displacements[j++]);
    MPI_Get_address(&amp;measure.state,       &amp;displacements[j++]);
    MPI_Get_address(&amp;measure.from,        &amp;displacements[j++]);
    MPI_Get_address(&amp;measure.recycling,   &amp;displacements[j++]);
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 1; i &lt; n; i++) displacements[i] -= displacements[0];
    displacements[0] = 0;

    MPI_Type_create_struct(n, lengths.data(), displacements, types, &amp;dt);
    MPI_Type_commit(&amp;dt);
    <span style="color: #a626a4;">return</span> dt;
  }

  <span style="color: #a626a4;">static</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #0184bc;">localDatabaseElement</span> () {
    <span style="color: #a626a4;">constexpr</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">n</span> = 2;
    <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">dt</span>;
    <span style="color: #c18401;">LocalDatabaseElement</span> <span style="color: #8b4513;">measure</span>;
    <span style="color: #a626a4;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int</span>&gt; <span style="color: #8b4513;">lengths</span>(n, 1);
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">types</span>[n]
      = { enumDt()
        , sliceInfo()
        };

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">measure the displacements in the struct</span>
    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span> = 0;
    <span style="color: #c18401;">MPI_Aint</span> <span style="color: #8b4513;">displacements</span>[n];
    MPI_Get_address(&amp;measure.name, &amp;displacements[j++]);
    MPI_Get_address(&amp;measure.info, &amp;displacements[j++]);
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 1; i &lt; n; i++) displacements[i] -= displacements[0];
    displacements[0] = 0;

    MPI_Type_create_struct(n, lengths.data(), displacements, types, &amp;dt);
    MPI_Type_commit(&amp;dt);
    <span style="color: #a626a4;">return</span> dt;
  }

};
</pre>
</div>
</div>
</div>
