atrip.org
*** Static utilities

This section presents some functions which are useful to work with
slices and are inside the namespace created by the slice struct.


The function =subtupleBySlice= gives to every =Slice::Type=
its meaning in terms of the triples \( (a,b,c) \).

Notice that since in general the relation
\( a < b < c \) holds (in our implementation), the case
of one-dimensional parametrizations =A=, =B= and =C= is well
defined.

The function should only throw if there is an implementation
error where the =Slice::Type= enum has been expanded and this
function has not been updated accordingly.

#+begin_src c++ :tangle (atrip-slice-h)
static
PartialTuple subtupleBySlice(ABCTuple abc, Type sliceType) {
  switch (sliceType) {
    case AB: return {abc[0], abc[1]};
    case BC: return {abc[1], abc[2]};
    case AC: return {abc[0], abc[2]};
    case CB: return {abc[2], abc[1]};
    case BA: return {abc[1], abc[0]};
    case CA: return {abc[2], abc[0]};
    case  A: return {abc[0], 0};
    case  B: return {abc[1], 0};
    case  C: return {abc[2], 0};
    default: throw "Switch statement not exhaustive!";
  }
}
#+end_src

In the context of cleaning up slices during the main loop,
it is important to check if a given slice has some slices
referencing to it in quality of recycled slices.

This function should therefore return a vector of pointers
of slices referencing to the given slice's info, when
the length of the vector is zero, then there are no dangling
links.
#+begin_src c++ :tangle (atrip-slice-h)
static std::vector<Slice*> hasRecycledReferencingToIt
  ( std::vector<Slice> &slices
  , Info const& info
  ) {
  std::vector<Slice*> result;

  for (auto& s: slices)
    if (  s.info.recycling == info.type
        && s.info.tuple == info.tuple
        && s.info.state == Recycled
        ) result.push_back(&s);

  return result;
}
#+end_src
    
The rest of the coming functions are utilities in order to find in a vector
of slices a given slice by reference. Mostly they are merely convenience
wrappers to the standard library function =std::find_if=.

They are named as =find<...>=, where =<...>= represents some condition
and must always return a reference to the found slice, i.e., =Slice&=.
=Atrip= relies on these functions to find the sought for slices,
therefore these functions will throw a =std::domain_error= if the
given slice could not be found.

#+begin_src c++ :tangle (atrip-slice-h)
static Slice& findOneByType(std::vector<Slice> &slices, Slice::Type type) {
    const auto sliceIt
      = std::find_if(slices.begin(), slices.end(),
                      [&type](Slice const& s) {
                        return type == s.info.type;
                      });
    WITH_CRAZY_DEBUG
    WITH_RANK
      << "__slice__:find:looking for " << type << "\n";
    if (sliceIt == slices.end())
      throw std::domain_error("Slice by type not found!");
    return *sliceIt;
}
#+end_src

#+begin_src c++ :tangle (atrip-slice-h)
static Slice&
findRecycledSource (std::vector<Slice> &slices, Slice::Info info) {
  const auto sliceIt
    = std::find_if(slices.begin(), slices.end(),
                    [&info](Slice const& s) {
                      return info.recycling == s.info.type
                          && info.tuple == s.info.tuple
                          && State::Recycled != s.info.state
                          ;
                    });

  WITH_CRAZY_DEBUG
  WITH_RANK << "__slice__:find: recycling source of "
            << pretty_print(info) << "\n";
  if (sliceIt == slices.end())
    throw std::domain_error( "Slice not found: "
                            + pretty_print(info)
                            + " rank: "
                            + pretty_print(Atrip::rank)
                            );
  WITH_RANK << "__slice__:find: " << pretty_print(sliceIt->info) << "\n";
  return *sliceIt;
}
#+end_src

#+begin_src c++ :tangle (atrip-slice-h)
static Slice& findByTypeAbc
  ( std::vector<Slice> &slices
  , Slice::Type type
  , ABCTuple const& abc
  ) {
    const auto tuple = Slice::subtupleBySlice(abc, type);
    const auto sliceIt
      = std::find_if(slices.begin(), slices.end(),
                      [&type, &tuple](Slice const& s) {
                        return type == s.info.type
                            && tuple == s.info.tuple
                            ;
                      });
    WITH_CRAZY_DEBUG
    WITH_RANK << "__slice__:find:" << type << " and tuple "
              << pretty_print(tuple)
              << "\n";
    if (sliceIt == slices.end())
      throw std::domain_error( "Slice not found: "
                              + pretty_print(tuple)
                              + ", "
                              + pretty_print(type)
                              + " rank: "
                              + pretty_print(Atrip::rank)
                              );
    return *sliceIt;
}
#+end_src

#+begin_src c++ :tangle (atrip-slice-h)
static Slice& findByInfo(std::vector<Slice> &slices,
                         Slice::Info const& info) {
  const auto sliceIt
    = std::find_if(slices.begin(), slices.end(),
                   [&info](Slice const& s) {
                     // TODO: maybe implement comparison in Info struct
                     return info.type == s.info.type
                       && info.state == s.info.state
                       && info.tuple == s.info.tuple
                       && info.from.rank == s.info.from.rank
                       && info.from.source == s.info.from.source
                       ;
                   });
  WITH_CRAZY_DEBUG
    WITH_RANK << "__slice__:find:looking for " << pretty_print(info) << "\n";
  if (sliceIt == slices.end())
    throw std::domain_error( "Slice by info not found: "
                             + pretty_print(info));
  return *sliceIt;
}
#+end_src

