atrip.html

<div id="outline-container-orgb3c66c9" class="outline-3">
<h3 id="orgb3c66c9"><span class="section-number-3">2.9</span> Static utilities</h3>
<div class="outline-text-3" id="text-2-9">
<p>
This section presents some functions which are useful to work with
slices and are inside the namespace created by the slice struct.
</p>


<p>
The function <code>subtupleBySlice</code> gives to every <code>Slice::Type</code>
its meaning in terms of the triples \( (a,b,c) \).
</p>

<p>
Notice that since in general the relation
\( a < b < c \) holds (in our implementation), the case
of one-dimensional parametrizations <code>A</code>, <code>B</code> and <code>C</code> is well
defined.
</p>

<p>
The function should only throw if there is an implementation
error where the <code>Slice::Type</code> enum has been expanded and this
function has not been updated accordingly.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">static</span>
<span style="color: #c18401;">PartialTuple</span> <span style="color: #0184bc;">subtupleBySlice</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #8b4513;">abc</span>, <span style="color: #c18401;">Type</span> <span style="color: #8b4513;">sliceType</span>) {
  <span style="color: #a626a4;">switch</span> (sliceType) {
    <span style="color: #a626a4;">case</span> AB: <span style="color: #a626a4;">return</span> {abc[0], abc[1]};
    <span style="color: #a626a4;">case</span> BC: <span style="color: #a626a4;">return</span> {abc[1], abc[2]};
    <span style="color: #a626a4;">case</span> AC: <span style="color: #a626a4;">return</span> {abc[0], abc[2]};
    <span style="color: #a626a4;">case</span> CB: <span style="color: #a626a4;">return</span> {abc[2], abc[1]};
    <span style="color: #a626a4;">case</span> BA: <span style="color: #a626a4;">return</span> {abc[1], abc[0]};
    <span style="color: #a626a4;">case</span> CA: <span style="color: #a626a4;">return</span> {abc[2], abc[0]};
    <span style="color: #a626a4;">case</span>  A: <span style="color: #a626a4;">return</span> {abc[0], 0};
    <span style="color: #a626a4;">case</span>  B: <span style="color: #a626a4;">return</span> {abc[1], 0};
    <span style="color: #a626a4;">case</span>  C: <span style="color: #a626a4;">return</span> {abc[2], 0};
    <span style="color: #a626a4;">default</span>: <span style="color: #a626a4;">throw</span> <span style="color: #50a14f;">"Switch statement not exhaustive!"</span>;
  }
}
</pre>
</div>

<p>
In the context of cleaning up slices during the main loop,
it is important to check if a given slice has some slices
referencing to it in quality of recycled slices.
</p>

<p>
This function should therefore return a vector of pointers
of slices referencing to the given slice's info, when
the length of the vector is zero, then there are no dangling
links.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">static</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">Slice</span>*&gt; <span style="color: #0184bc;">hasRecycledReferencingToIt</span>
  ( <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">Slice</span>&gt; &amp;<span style="color: #8b4513;">slices</span>
  , <span style="color: #c18401;">Info</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">info</span>
  ) {
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">Slice</span>*&gt; <span style="color: #8b4513;">result</span>;

  <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">s</span>: slices)
    <span style="color: #a626a4;">if</span> (  s.info.recycling == info.type
        &amp;&amp; s.info.tuple == info.tuple
        &amp;&amp; s.info.state == Recycled
        ) result.push_back(&amp;s);

  <span style="color: #a626a4;">return</span> result;
}
</pre>
</div>

<p>
The rest of the coming functions are utilities in order to find in a vector
of slices a given slice by reference. Mostly they are merely convenience
wrappers to the standard library function <code>std::find_if</code>.
</p>

<p>
They are named as <code>find&lt;...&gt;</code>, where <code>&lt;...&gt;</code> represents some condition
and must always return a reference to the found slice, i.e., <code>Slice&amp;</code>.
<code>Atrip</code> relies on these functions to find the sought for slices,
therefore these functions will throw a <code>std::domain_error</code> if the
given slice could not be found.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">static</span> <span style="color: #c18401;">Slice</span>&amp; <span style="color: #0184bc;">findOneByType</span>(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">Slice</span>&gt; &amp;<span style="color: #8b4513;">slices</span>, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Type</span> <span style="color: #8b4513;">type</span>) {
    <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">sliceIt</span>
      = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(slices.begin(), slices.end(),
                      [&amp;<span style="color: #8b4513;">type</span>](<span style="color: #c18401;">Slice</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>) {
                        <span style="color: #a626a4;">return</span> type == s.info.type;
                      });
    <span style="color: #c18401;">WITH_CRAZY_DEBUG</span>
    <span style="color: #8b4513;">WITH_RANK</span>
      &lt;&lt; <span style="color: #50a14f;">"__slice__:find:looking for "</span> &lt;&lt; type &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
    <span style="color: #a626a4;">if</span> (sliceIt == slices.end())
      <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error(<span style="color: #50a14f;">"Slice by type not found!"</span>);
    <span style="color: #a626a4;">return</span> *sliceIt;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">static</span> <span style="color: #c18401;">Slice</span>&amp;
<span style="color: #0184bc;">findRecycledSource</span> (<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">Slice</span>&gt; &amp;<span style="color: #8b4513;">slices</span>, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Info</span> <span style="color: #8b4513;">info</span>) {
  <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">sliceIt</span>
    = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(slices.begin(), slices.end(),
                    [&amp;<span style="color: #8b4513;">info</span>](<span style="color: #c18401;">Slice</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>) {
                      <span style="color: #a626a4;">return</span> info.recycling == s.info.type
                          &amp;&amp; info.tuple == s.info.tuple
                          &amp;&amp; <span style="font-weight: bold; text-decoration: underline;">State</span>::Recycled != s.info.state
                          ;
                    });

  <span style="color: #c18401;">WITH_CRAZY_DEBUG</span>
  <span style="color: #8b4513;">WITH_RANK</span> &lt;&lt; <span style="color: #50a14f;">"__slice__:find: recycling source of "</span>
            &lt;&lt; pretty_print(info) &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  <span style="color: #a626a4;">if</span> (sliceIt == slices.end())
    <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error( <span style="color: #50a14f;">"Slice not found: "</span>
                            + pretty_print(info)
                            + <span style="color: #50a14f;">" rank: "</span>
                            + pretty_print(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank)
                            );
  WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__slice__:find: "</span> &lt;&lt; pretty_print(sliceIt-&gt;info) &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  <span style="color: #a626a4;">return</span> *sliceIt;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">static</span> <span style="color: #c18401;">Slice</span>&amp; <span style="color: #0184bc;">findByTypeAbc</span>
  ( <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">Slice</span>&gt; &amp;<span style="color: #8b4513;">slices</span>
  , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Type</span> <span style="color: #8b4513;">type</span>
  , <span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>
  ) {
    <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">tuple</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::subtupleBySlice(abc, type);
    <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">sliceIt</span>
      = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(slices.begin(), slices.end(),
                      [&amp;<span style="color: #8b4513;">type</span>, &amp;<span style="color: #8b4513;">tuple</span>](<span style="color: #c18401;">Slice</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>) {
                        <span style="color: #a626a4;">return</span> type == s.info.type
                            &amp;&amp; tuple == s.info.tuple
                            ;
                      });
    <span style="color: #c18401;">WITH_CRAZY_DEBUG</span>
    <span style="color: #8b4513;">WITH_RANK</span> &lt;&lt; <span style="color: #50a14f;">"__slice__:find:"</span> &lt;&lt; type &lt;&lt; <span style="color: #50a14f;">" and tuple "</span>
              &lt;&lt; pretty_print(tuple)
              &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
    <span style="color: #a626a4;">if</span> (sliceIt == slices.end())
      <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error( <span style="color: #50a14f;">"Slice not found: "</span>
                              + pretty_print(tuple)
                              + <span style="color: #50a14f;">", "</span>
                              + pretty_print(type)
                              + <span style="color: #50a14f;">" rank: "</span>
                              + pretty_print(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank)
                              );
    <span style="color: #a626a4;">return</span> *sliceIt;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">static</span> <span style="color: #c18401;">Slice</span>&amp; <span style="color: #0184bc;">findByInfo</span>(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">Slice</span>&gt; &amp;<span style="color: #8b4513;">slices</span>,
                         <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Info</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">info</span>) {
  <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">sliceIt</span>
    = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(slices.begin(), slices.end(),
                   [&amp;<span style="color: #8b4513;">info</span>](<span style="color: #c18401;">Slice</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>) {
                     <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: maybe implement comparison in Info struct</span>
                     <span style="color: #a626a4;">return</span> info.type == s.info.type
                       &amp;&amp; info.state == s.info.state
                       &amp;&amp; info.tuple == s.info.tuple
                       &amp;&amp; info.from.rank == s.info.from.rank
                       &amp;&amp; info.from.source == s.info.from.source
                       ;
                   });
  <span style="color: #c18401;">WITH_CRAZY_DEBUG</span>
    <span style="color: #8b4513;">WITH_RANK</span> &lt;&lt; <span style="color: #50a14f;">"__slice__:find:looking for "</span> &lt;&lt; pretty_print(info) &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  <span style="color: #a626a4;">if</span> (sliceIt == slices.end())
    <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error( <span style="color: #50a14f;">"Slice by info not found: "</span>
                             + pretty_print(info));
  <span style="color: #a626a4;">return</span> *sliceIt;
}
</pre>
</div>
</div>
</div>
