atrip.html

<div id="outline-container-org99fcf28" class="outline-3">
<h3 id="org99fcf28"><span class="section-number-3">2.10</span> Attributes</h3>
<div class="outline-text-3" id="text-2-10">
<p>
A slice object does not own data, it is just a container
or a pointer to data together with additional bookkeeping facilities.
</p>

<p>
It includes an info structure with the information about the slice,
<code>Type</code>, <code>State</code> etc, which will be later communicated to other ranks.
</p>

<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #c18401;">Info</span> <span style="color: #8b4513;">info</span>;
</pre>
</div>

<p>
A pointer to data is also necessary for the <code>Slice</code> but not necessary
to be communicated to other ranks. The <code>Slice</code> should never allocate
or deallocate itself the pointer.
</p>
<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #c18401;">F</span>  *<span style="color: #8b4513;">data</span>;
</pre>
</div>

<p>
An <code>MPI_Request</code> handle is also included so that the slices that are
to receive data through MPI can know which request they belong to.
</p>
<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #c18401;">MPI_Request</span> <span style="color: #8b4513;">request</span>;
</pre>
</div>

<p>
For practical purposes in MPI calls, the number of elements in <code>data</code> is also included.
</p>
<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">size</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org23ab391" class="outline-3">
<h3 id="org23ab391"><span class="section-number-3">2.11</span> Member functions</h3>
<div class="outline-text-3" id="text-2-11">
<p>
It is important to note that a ready slice should not be recycled from
any other slice, so that it can have access by itself to the data.
</p>
<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">markReady</span>() <span style="color: #a626a4;">noexcept</span> {
      info.state = Ready;
      info.recycling = Blank;
    }
</pre>
</div>


<p>
The following function asks wether or not
the slice has effectively been unwrapped or not,
i.e., wether or not the data are accessible and already
there. This can only happen in two ways, either
is the slice <code>Ready</code> or it is <code>SelfSufficient</code>,
i.e., the data pointed to was pre-distributed to the current node.
</p>
<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">isUnwrapped</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> info.state == Ready
          || info.state == SelfSufficient
          ;
    }
</pre>
</div>

<p>
The function <code>isUnwrappable</code> answers which slices can be unwrapped
potentially. Unwrapped slices can be unwrapped again idempotentially.
Also <code>Recycled</code> slices can be unwrapped, i.e. the slices pointed to by them
will be unwrapped.
The only other possibility is that the slice has been dispatched
in the past and can be unwrapped. The case where the state
is <code>Dispatched</code> is the canonical intuitive case where a real process
of unwrapping, i.e. waiting for the data to get through the network,
is done.
</p>
<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">isUnwrappable</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> isUnwrapped()
          || info.state == Recycled
          || info.state == Dispatched
          ;
    }

    <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">isDirectlyFetchable</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> info.state == Ready || info.state == Dispatched;
    }

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">free</span>() <span style="color: #a626a4;">noexcept</span> {
      info.tuple      = {0, 0};
      info.type       = Blank;
      info.state      = Acceptor;
      info.from       = {0, 0};
      info.recycling  = Blank;
      data            = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>;
    }

    <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">isFree</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> info.tuple       == PartialTuple{0, 0}
          &amp;&amp; info.type        == Blank
          &amp;&amp; info.state       == Acceptor
          &amp;&amp; info.from.rank   == 0
          &amp;&amp; info.from.source == 0
          &amp;&amp; info.recycling   == Blank
          &amp;&amp; data             == <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
           ;
    }

</pre>
</div>

<p>
The function <code>isRecylable</code> answers the question, which slices can be recycled.
</p>

<p>
A slice can only be recycled if it is Fetch or Ready and has
a valid datapointer.
</p>

<p>
In particular, SelfSufficient are not recyclable, since it is easier
just to create a SelfSufficient slice than deal with data dependencies.
</p>

<p>
Furthermore, a recycled slice is not recyclable, if this is the case
then it is either bad design or a bug.
</p>

<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">isRecyclable</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> (  info.state == Dispatched
             || info.state == Ready
             || info.state == Fetch
             )
          &amp;&amp; hasValidDataPointer()
          ;
    }
</pre>
</div>


<p>
The function <code>hasValidDataPointer</code> describes if a slice has a valid
data pointer.
</p>

<p>
This is important to know if the slice has some data to it, also
some structural checks are done, so that it should not be <code>Acceptor</code>
or <code>Blank</code>, if this is the case then it is a bug.
</p>

<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">hasValidDataPointer</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> data       != <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
          &amp;&amp; info.state != Acceptor
          &amp;&amp; info.type  != Blank
          ;
    }
</pre>
</div>


<p>
The function
<code>unwrapAndMarkReady</code>
calls the low-level MPI functions
in order to wait whenever the state of the slice is correct.
The main behaviour of the function should
</p>
<ul class="org-ul">
<li>return if state is <code>Ready</code>, since then there is nothing to be done.</li>
<li>throw if the state is not <code>Dispatched</code>, only a dispatched slice
can be unwrapped through MPI.</li>
<li>throw if an MPI error happens.</li>
</ul>


<div class="org-src-container">
<pre class="src src-c++">    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">unwrapAndMarkReady</span>() {
      <span style="color: #a626a4;">if</span> (info.state == Ready) <span style="color: #a626a4;">return</span>;
      <span style="color: #a626a4;">if</span> (info.state != Dispatched)
        <span style="color: #a626a4;">throw</span>
          <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error(<span style="color: #50a14f;">"Can't unwrap a non-ready, non-dispatched slice!"</span>);
      markReady();
      <span style="color: #c18401;">MPI_Status</span> <span style="color: #8b4513;">status</span>;
<span style="color: #e44649;">#ifdef</span> HAVE_OCD
        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__slice__:mpi: waiting "</span> &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
<span style="color: #e44649;">#endif</span>
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">errorCode</span> = MPI_Wait(&amp;request, &amp;status);
      <span style="color: #a626a4;">if</span> (errorCode != MPI_SUCCESS)
        <span style="color: #a626a4;">throw</span> <span style="color: #50a14f;">"MPI ERROR HAPPENED...."</span>;

<span style="color: #e44649;">#ifdef</span> HAVE_OCD
      <span style="color: #c18401;">char</span> <span style="color: #8b4513;">errorString</span>[MPI_MAX_ERROR_STRING];
      <span style="color: #c18401;">int</span> <span style="color: #8b4513;">errorSize</span>;
      MPI_Error_string(errorCode, errorString, &amp;errorSize);

      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__slice__:mpi: status "</span>
                &lt;&lt; <span style="color: #50a14f;">"{ .source="</span>    &lt;&lt; status.MPI_SOURCE
                &lt;&lt; <span style="color: #50a14f;">", .tag="</span>       &lt;&lt; status.MPI_TAG
                &lt;&lt; <span style="color: #50a14f;">", .error="</span>     &lt;&lt; status.MPI_ERROR
                &lt;&lt; <span style="color: #50a14f;">", .errCode="</span>   &lt;&lt; errorCode
                &lt;&lt; <span style="color: #50a14f;">", .err="</span>       &lt;&lt; errorString
                &lt;&lt; <span style="color: #50a14f;">" }"</span>
                &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
<span style="color: #e44649;">#endif</span>
    }
</pre>
</div>
</div>
</div>
</div>
