atrip.org
*** Epilog                                                         :noexport:
#+begin_src c++ :tangle (atrip-slice-h)
    Slice(size_t size_)
      : info({})
      , data(nullptr)
      , size(size_)
      {}


  }; // struct Slice

#+end_src

*** Debug                                                          :noexport:

#+begin_src c++ :tangle (atrip-slice-h)
std::ostream& operator<<(std::ostream& out, Slice::Location const& v) {
  // TODO: remove me
  out << "{.r(" << v.rank << "), .s(" << v.source << ")};";
  return out;
}

std::ostream& operator<<(std::ostream& out, Slice::Info const& i) {
  out << "«t" << i.type << ", s" << i.state << "»"
      << " ⊙ {" << i.from.rank << ", " << i.from.source << "}"
      << " ∴ {" << i.tuple[0] << ", " << i.tuple[1] << "}"
      << " ♲t" << i.recycling
      ;
  return out;
}

} // namespace atrip
#+end_src

** Utils

This section presents some utilities
*** Prolog                                                         :noexport:
#+begin_src c++ :tangle (atrip-utils-h)
#pragma once
#include <sstream>
#include <string>
#include <map>
#include <chrono>

#include <ctf.hpp>
#include <atrip/Debug.hpp>

namespace atrip {
#+end_src

*** Pretty printing

The pretty printing uses the [[https://github.com/sharkdp/dbg-macro][dbg-macro]] package.

#+begin_src c++ :tangle (atrip-utils-h)
  template <typename T>
  std::string pretty_print(T&& value) {
    std::stringstream stream;
#if ATRIP_DEBUG > 1
    dbg::pretty_print(stream, std::forward<T>(value));
#endif
    return stream.str();
  }

#+end_src

*** Chrono

The chrono is just a simple wrapper for a high resolution clock
that can be found in the =std::chrono= namespace of the standard library.

#+begin_src c++ :tangle (atrip-utils-h)
#define WITH_CHRONO(__chrono_name, ...)         \
  Atrip::chrono[__chrono_name].start();         \
  __VA_ARGS__                                   \
  Atrip::chrono[__chrono_name].stop();

struct Timer {
  using Clock = std::chrono::high_resolution_clock;
  using Event = std::chrono::time_point<Clock>;
  std::chrono::duration<double> duration;
  Event _start;
  inline void start() noexcept { _start = Clock::now(); }
  inline void stop() noexcept { duration += Clock::now() - _start; }
  inline void clear() noexcept { duration *= 0; }
  inline double count() const noexcept { return duration.count(); }
};
using Timings = std::map<std::string, Timer>;

#+end_src


*** Epilog                                                         :noexport:
#+begin_src c++ :tangle (atrip-utils-h)
}
#+end_src

