atrip.html

<div id="outline-container-org7e59ffa" class="outline-2">
<h2 id="org7e59ffa"><span class="section-number-2">3</span> Utils</h2>
<div class="outline-text-2" id="text-3">
<p>
This section presents some utilities
</p>
</div>
<div id="outline-container-org6819c29" class="outline-3">
<h3 id="org6819c29"><span class="section-number-3">3.1</span> Pretty printing</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The pretty printing uses the <a href="https://github.com/sharkdp/dbg-macro">dbg-macro</a> package.
</p>

<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #a626a4;">template</span> &lt;<span style="color: #a626a4;">typename</span> <span style="color: #c18401;">T</span>&gt;
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">string</span> <span style="color: #0184bc;">pretty_print</span>(<span style="color: #c18401;">T</span>&amp;&amp; <span style="color: #8b4513;">value</span>) {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">stringstream</span> <span style="color: #8b4513;">stream</span>;
<span style="color: #e44649;">#if</span> ATRIP_DEBUG &gt; 1
    <span style="font-weight: bold; text-decoration: underline;">dbg</span>::pretty_print(stream, <span style="font-weight: bold; text-decoration: underline;">std</span>::forward&lt;<span style="color: #c18401;">T</span>&gt;(value));
<span style="color: #e44649;">#endif</span>
    <span style="color: #a626a4;">return</span> stream.str();
  }

</pre>
</div>
</div>
</div>

<div id="outline-container-orgc27b6f2" class="outline-3">
<h3 id="orgc27b6f2"><span class="section-number-3">3.2</span> Chrono</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The chrono is just a simple wrapper for a high resolution clock
that can be found in the <code>std::chrono</code> namespace of the standard library.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#define</span> <span style="color: #0184bc;">WITH_CHRONO</span>(<span style="color: #8b4513;">__chrono_name</span>, ...)         \
  <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[__chrono_name].start();         \
  <span style="color: #c18401;">__VA_ARGS__</span>                                   \
  <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #8b4513;">chrono</span>[__chrono_name].stop();

<span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Timer</span> {
  <span style="color: #a626a4;">using</span> <span style="color: #c18401;">Clock</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">chrono</span>::high_resolution_clock;
  <span style="color: #a626a4;">using</span> <span style="color: #c18401;">Event</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">chrono</span>::<span style="color: #c18401;">time_point</span>&lt;<span style="color: #c18401;">Clock</span>&gt;;
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">chrono</span>::<span style="color: #c18401;">duration</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #8b4513;">duration</span>;
  <span style="color: #c18401;">Event</span> <span style="color: #8b4513;">_start</span>;
  <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">void</span> <span style="color: #0184bc;">start</span>() <span style="color: #a626a4;">noexcept</span> { _start = <span style="font-weight: bold; text-decoration: underline;">Clock</span>::now(); }
  <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">void</span> <span style="color: #0184bc;">stop</span>() <span style="color: #a626a4;">noexcept</span> { duration += <span style="font-weight: bold; text-decoration: underline;">Clock</span>::now() - _start; }
  <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">void</span> <span style="color: #0184bc;">clear</span>() <span style="color: #a626a4;">noexcept</span> { duration *= 0; }
  <span style="color: #a626a4;">inline</span> <span style="color: #c18401;">double</span> <span style="color: #0184bc;">count</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> { <span style="color: #a626a4;">return</span> duration.count(); }
};
<span style="color: #a626a4;">using</span> <span style="color: #c18401;">Timings</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">map</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::string, <span style="color: #c18401;">Timer</span>&gt;;

</pre>
</div>
</div>
</div>
</div>
