atrip.html

<div id="outline-container-org393169e" class="outline-2">
<h2 id="org393169e"><span class="section-number-2">4</span> The rank mapping</h2>
<div class="outline-text-2" id="text-4">
<p>
This section introduces the concept of rank mapping,
which defines how slices will be allocated to every
rank.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#pragma</span> once

<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;vector&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;algorithm&gt;</span>

<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Slice.hpp&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Tuples.hpp&gt;</span>

<span style="color: #a626a4;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span> {
  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">RankMap</span> {

    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">bool</span> <span style="color: #8b4513;">RANK_ROUND_ROBIN</span>;
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt; <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">lengths</span>;
    <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">np</span>, <span style="color: #8b4513;">size</span>;
    <span style="color: #c18401;">ClusterInfo</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">clusterInfo</span>;

    <span style="color: #0184bc;">RankMap</span>(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt; <span style="color: #8b4513;">lens</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np_</span>, <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">comm</span>)
      : lengths(lens)
      , np(np_)
      , size(<span style="font-weight: bold; text-decoration: underline;">std</span>::accumulate(lengths.begin(), lengths.end(),
                            1UL, <span style="font-weight: bold; text-decoration: underline;">std</span>::multiplies&lt;<span style="color: #c18401;">size_t</span>&gt;()))
      , clusterInfo(getClusterInfo(comm))
    { assert(lengths.size() &lt;= 2); }

    <span style="color: #c18401;">size_t</span> <span style="color: #0184bc;">find</span>(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Location</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">p</span>) <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">if</span> (RANK_ROUND_ROBIN) {
        <span style="color: #a626a4;">return</span> p.source * np + p.rank;
      } <span style="color: #a626a4;">else</span> {
        <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span>
          <span style="color: #8b4513;">rankPosition</span> = p.source * clusterInfo.ranksPerNode
                       + clusterInfo.rankInfos[p.rank].localRank
                       ;
        <span style="color: #a626a4;">return</span> rankPosition * clusterInfo.nNodes
             + clusterInfo.rankInfos[p.rank].nodeId
             ;
      }
    }

    <span style="color: #c18401;">size_t</span> <span style="color: #0184bc;">nSources</span>() <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> size / np + size_t(size % np != 0);
    }


    <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">isPaddingRank</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">rank</span>) <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> size % np == 0
          ? <span style="font-weight: bold; text-decoration: underline;">false</span>
          : rank &gt; (size % np - 1)
          ;
    }

    <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">isSourcePadding</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">rank</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">source</span>) <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">return</span> source == nSources() &amp;&amp; isPaddingRank(rank);
    }

    <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Location</span>
    <span style="color: #0184bc;">find</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Type</span> <span style="color: #8b4513;">sliceType</span>) <span style="color: #a626a4;">const</span> {
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">tuple = {11, 8} when abc = {11, 8, 9} and sliceType = AB</span>
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">tuple = {11, 0} when abc = {11, 8, 9} and sliceType = A</span>
      <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">tuple</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::subtupleBySlice(abc, sliceType);

      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">index</span>
        = tuple[0]
        + tuple[1] * (lengths.size() &gt; 1 ? lengths[0] : 0)
        ;

      <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">rank</span>, <span style="color: #8b4513;">source</span>;

      <span style="color: #a626a4;">if</span> (RANK_ROUND_ROBIN) {

        rank = index % np;
        source = index / np;

      } <span style="color: #a626a4;">else</span> {

        <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span>

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">the node that will be assigned to</span>
            <span style="color: #8b4513;">nodeId</span> = index % clusterInfo.nNodes

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">how many times it has been assigned to the node</span>
          , <span style="color: #8b4513;">s_n</span> = index / clusterInfo.nNodes

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">which local rank in the node should be</span>
          , <span style="color: #8b4513;">localRank</span> = s_n % clusterInfo.ranksPerNode

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">and the local source (how many times we chose this local rank)</span>
          , <span style="color: #8b4513;">localSource</span> = s_n / clusterInfo.ranksPerNode
          ;

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">find the localRank-th entry in clusterInfo</span>
        <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">it</span> =
          <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(clusterInfo.rankInfos.begin(),
                       clusterInfo.rankInfos.end(),
                       [<span style="font-weight: bold; text-decoration: underline;">nodeId</span>, <span style="font-weight: bold; text-decoration: underline;">localRank</span>](<span style="color: #c18401;">RankInfo</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">ri</span>) {
                         <span style="color: #a626a4;">return</span> ri.nodeId == nodeId
                             &amp;&amp; ri.localRank == localRank
                             ;
                       });
        <span style="color: #a626a4;">if</span> (it == clusterInfo.rankInfos.end()) {
          <span style="color: #a626a4;">throw</span> <span style="color: #50a14f;">"FATAL! Error in node distribution of the slices"</span>;
        }

        rank = (*it).globalRank;
        source = localSource;

      }

      <span style="color: #a626a4;">return</span>
        { rank
        , source
        };
    }

  };

}
</pre>
</div>
</div>
</div>
