atrip.html

<div id="outline-container-org537d7e2" class="outline-2">
<h2 id="org537d7e2"><span class="section-number-2">5</span> The slice union</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#pragma</span> once
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Debug.hpp&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Slice.hpp&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/RankMap.hpp&gt;</span>

<span style="color: #a626a4;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span> {

  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">SliceUnion</span> {
    <span style="color: #a626a4;">using</span> <span style="color: #c18401;">F</span> = <span style="color: #c18401;">double</span>;
    <span style="color: #a626a4;">using</span> <span style="color: #c18401;">Tensor</span> = <span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">F</span>&gt;;

    <span style="color: #a626a4;">virtual</span> <span style="color: #c18401;">void</span>
    <span style="color: #0184bc;">sliceIntoBuffer</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">iteration</span>, <span style="color: #c18401;">Tensor</span> &amp;<span style="color: #8b4513;">to</span>, <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">from</span>) = 0;

    <span style="color: #a0a1a7; font-weight: bold;">/*</span>
<span style="color: #a0a1a7;">     * This function should enforce an important property of a SliceUnion.</span>
<span style="color: #a0a1a7;">     * Namely, there can be no two Slices of the same nature.</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7;">     * This means that there can be at most one slice with a given Ty_x_Tu.</span>
<span style="color: #a0a1a7; font-weight: bold;">     */</span>
    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">checkForDuplicates</span>() <span style="color: #a626a4;">const</span> {
      <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Slice</span>::Ty_x_Tu&gt; <span style="color: #8b4513;">tytus</span>;
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>: slices) {
        <span style="color: #a626a4;">if</span> (s.isFree()) <span style="color: #a626a4;">continue</span>;
        tytus.push_back({s.info.type, s.info.tuple});
      }

      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">tytu</span>: tytus) {
        <span style="color: #a626a4;">if</span> (<span style="font-weight: bold; text-decoration: underline;">std</span>::count(tytus.begin(), tytus.end(), tytu) &gt; 1)
          <span style="color: #a626a4;">throw</span> <span style="color: #50a14f;">"Invariance violated, more than one slice with same Ty_x_Tu"</span>;
      }

    }

    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Slice</span>::Ty_x_Tu&gt; <span style="color: #0184bc;">neededSlices</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>) {
      <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Slice</span>::Ty_x_Tu&gt; <span style="color: #8b4513;">needed</span>(sliceTypes.size());
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">build the needed vector</span>
      <span style="font-weight: bold; text-decoration: underline;">std</span>::transform(sliceTypes.begin(), sliceTypes.end(),
                     needed.begin(),
                     [&amp;<span style="color: #8b4513;">abc</span>](<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Type</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">type</span>) {
                       <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">tuple</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::subtupleBySlice(abc, type);
                       <span style="color: #a626a4;">return</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::make_pair(type, tuple);
                     });
      <span style="color: #a626a4;">return</span> needed;
    }

    <span style="color: #a0a1a7; font-weight: bold;">/* </span><span style="color: #a0a1a7;">buildLocalDatabase</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7;">     * It should build a database of slices so that we know what is needed</span>
<span style="color: #a0a1a7;">     * to fetch in the next iteration represented by the tuple 'abc'.</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7;">     * 1. The algorithm works as follows, we build a database of the all</span>
<span style="color: #a0a1a7;">     * the slice types that we need together with their tuple.</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7;">     * 2. Look in the SliceUnion if we already have this tuple,</span>
<span style="color: #a0a1a7;">     * if we already have it mark it (TODO)</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7;">     * 3. If we don't have the tuple, look for a (state=acceptor, type=blank)</span>
<span style="color: #a0a1a7;">     * slice and mark this slice as type=Fetch with the corresponding type</span>
<span style="color: #a0a1a7;">     * and tuple.</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7;">     * NOTE: The algorithm should certify that we always have enough blank</span>
<span style="color: #a0a1a7;">     * slices.</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7; font-weight: bold;">     */</span>
    <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">LocalDatabase</span> <span style="color: #0184bc;">buildLocalDatabase</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>) {
      <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">LocalDatabase</span> <span style="color: #8b4513;">result</span>;

      <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">needed</span> = neededSlices(abc);

      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__:needed:"</span> &lt;&lt; pretty_print(<span style="color: #c18401;">needed</span>) &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">BUILD THE DATABASE</span>
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">we need to loop over all sliceTypes that this TensorUnion</span>
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">is representing and find out how we will get the corresponding</span>
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">slice for the abc we are considering right now.</span>
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">pair</span>: needed) {
        <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">type</span> = pair.first;
        <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">tuple</span> = pair.second;
        <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">from</span>  = rankMap.find(abc, <span style="color: #c18401;">type</span>);

<span style="color: #e44649;">#ifdef</span> HAVE_OCD
        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__:want:"</span> &lt;&lt; pretty_print(pair) &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
        <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>: slices)
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__:guts:ocd "</span>
                    &lt;&lt; s.info &lt;&lt; <span style="color: #50a14f;">" pt "</span> &lt;&lt; s.data
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
<span style="color: #e44649;">#endif</span>

<span style="color: #e44649;">#ifdef</span> HAVE_OCD
        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__: checking if exact match"</span> &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
<span style="color: #e44649;">#endif</span>
        {
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">FIRST: look up if there is already a *Ready* slice matching what we</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">need</span>
          <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">it</span>
            = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(slices.begin(), slices.end(),
                           [&amp;<span style="color: #8b4513;">tuple</span>, &amp;<span style="color: #8b4513;">type</span>](<span style="color: #c18401;">Slice</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">other</span>) {
                             <span style="color: #a626a4;">return</span> other.info.tuple == tuple
                                 &amp;&amp; other.info.type == type
                                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">we only want another slice when it</span>
                                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">has already ready-to-use data</span>
                                 &amp;&amp; other.isUnwrappable()
                                 ;
                           });
          <span style="color: #a626a4;">if</span> (it != slices.end()) {
            <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">if we find this slice, it means that we don't have to do anything</span>
            WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__: EXACT: found EXACT in name="</span> &lt;&lt; name
                      &lt;&lt; <span style="color: #50a14f;">" for tuple "</span> &lt;&lt; tuple[0] &lt;&lt; <span style="color: #50a14f;">", "</span> &lt;&lt; tuple[1]
                      &lt;&lt; <span style="color: #50a14f;">" ptr "</span> &lt;&lt; it-&gt;data
                      &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
            result.push_back({name, it-&gt;info});
            <span style="color: #a626a4;">continue</span>;
          }
        }

<span style="color: #e44649;">#ifdef</span> HAVE_OCD
        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__: checking if recycle"</span> &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
<span style="color: #e44649;">#endif</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Try to find a recyling possibility ie. find a slice with the same</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">tuple and that has a valid data pointer.</span>
        <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">recycleIt</span>
          = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(slices.begin(), slices.end(),
                         [&amp;<span style="color: #8b4513;">tuple</span>, &amp;<span style="color: #8b4513;">type</span>](<span style="color: #c18401;">Slice</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">other</span>) {
                           <span style="color: #a626a4;">return</span> other.info.tuple == tuple
                               &amp;&amp; other.info.type != type
                               &amp;&amp; other.isRecyclable()
                               ;
                         });

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">if we find this recylce, then we find a Blank slice</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">(which should exist by construction :THINK)</span>
        <span style="color: #a0a1a7; font-weight: bold;">//</span>
        <span style="color: #a626a4;">if</span> (recycleIt != slices.end()) {
          <span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">blank</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::findOneByType(slices, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Blank);
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: formalize this through a method to copy information</span>
          <span style="color: #a0a1a7; font-weight: bold;">//       </span><span style="color: #a0a1a7;">from another slice</span>
          blank.data = recycleIt-&gt;data;
          blank.info.type = type;
          blank.info.tuple = tuple;
          blank.info.state = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Recycled;
          blank.info.from = from;
          blank.info.recycling = recycleIt-&gt;info.type;
          result.push_back({name, blank.info});
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__: RECYCLING: n"</span> &lt;&lt; name
                    &lt;&lt; <span style="color: #50a14f;">" "</span> &lt;&lt; pretty_print(abc)
                    &lt;&lt; <span style="color: #50a14f;">" get "</span> &lt;&lt; pretty_print(blank.info)
                    &lt;&lt; <span style="color: #50a14f;">" from "</span> &lt;&lt; pretty_print(recycleIt-&gt;info)
                    &lt;&lt; <span style="color: #50a14f;">" ptr "</span> &lt;&lt; recycleIt-&gt;data
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>
                    ;
          <span style="color: #a626a4;">continue</span>;
        }

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">in this case we have to create a new slice</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">this means that we should have a blank slice at our disposal</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">and also the freePointers should have some elements inside,</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">so we pop a data pointer from the freePointers container</span>
<span style="color: #e44649;">#ifdef</span> HAVE_OCD
        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__: none work, doing new"</span> &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
<span style="color: #e44649;">#endif</span>
        {
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__: NEW: finding blank in "</span> &lt;&lt; name
                    &lt;&lt; <span style="color: #50a14f;">" for type "</span> &lt;&lt; type
                    &lt;&lt; <span style="color: #50a14f;">" for tuple "</span> &lt;&lt; tuple[0] &lt;&lt; <span style="color: #50a14f;">", "</span> &lt;&lt; tuple[1]
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>
                    ;
          <span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">blank</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::findOneByType(slices, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Blank);
          blank.info.type = type;
          blank.info.tuple = tuple;
          blank.info.from = from;

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Handle self sufficiency</span>
          blank.info.state = <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank == from.rank
                           ? <span style="font-weight: bold; text-decoration: underline;">Slice</span>::SelfSufficient
                           : <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Fetch
                           ;
          <span style="color: #a626a4;">if</span> (blank.info.state == <span style="font-weight: bold; text-decoration: underline;">Slice</span>::SelfSufficient) {
            blank.data = sources[from.source].data();
          } <span style="color: #a626a4;">else</span> {
            <span style="color: #a626a4;">if</span> (freePointers.size() == 0) {
              <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">stringstream</span> <span style="color: #8b4513;">stream</span>;
              stream &lt;&lt; <span style="color: #50a14f;">"No more free pointers "</span>
                     &lt;&lt; <span style="color: #50a14f;">"for type "</span> &lt;&lt; type
                     &lt;&lt; <span style="color: #50a14f;">" and name "</span> &lt;&lt; name
                      ;
              <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error(stream.str());
            }
            <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">dataPointer</span> = freePointers.begin();
            freePointers.erase(dataPointer);
            blank.data = *dataPointer;
          }

          result.push_back({name, blank.info});
          <span style="color: #a626a4;">continue</span>;
        }

      }

<span style="color: #e44649;">#ifdef</span> HAVE_OCD
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>: slices)
        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__db__:guts:ocd:__end__ "</span> &lt;&lt; s.info &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
<span style="color: #e44649;">#endif</span>


      <span style="color: #a626a4;">return</span> result;

    }

    <span style="color: #a0a1a7; font-weight: bold;">/*</span>
<span style="color: #a0a1a7;">     * Garbage collect slices not needed for the next iteration.</span>
<span style="color: #a0a1a7;">     *</span>
<span style="color: #a0a1a7;">     * It will throw if it tries to gc a slice that has not been</span>
<span style="color: #a0a1a7;">     * previously unwrapped, as a safety mechanism.</span>
<span style="color: #a0a1a7; font-weight: bold;">     */</span>
    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">clearUnusedSlicesForNext</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>) {
      <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">needed</span> = neededSlices(abc);

      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">CLEAN UP SLICES, FREE THE ONES THAT ARE NOT NEEDED ANYMORE</span>
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">slice</span>: slices) {
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">if the slice is free, then it was not used anyways</span>
        <span style="color: #a626a4;">if</span> (slice.isFree()) <span style="color: #a626a4;">continue</span>;


        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">try to find the slice in the needed slices list</span>
        <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">found</span>
          = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(needed.begin(), needed.end(),
                         [&amp;<span style="color: #8b4513;">slice</span>] (<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Ty_x_Tu</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">tytu</span>) {
                           <span style="color: #a626a4;">return</span> slice.info.tuple == tytu.second
                               &amp;&amp; slice.info.type == tytu.first
                               ;
                         });

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">if we did not find slice in needed, then erase it</span>
        <span style="color: #a626a4;">if</span> (found == needed.end()) {

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">We have to be careful about the data pointer,</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">for SelfSufficient, the data pointer is a source pointer</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">of the slice, so we should just wipe it.</span>
          <span style="color: #a0a1a7; font-weight: bold;">//</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">For Ready slices, we have to be careful if there are some</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">recycled slices depending on it.</span>
          <span style="color: #c18401;">bool</span> <span style="color: #8b4513;">freeSlicePointer</span> = <span style="font-weight: bold; text-decoration: underline;">true</span>;

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">allow to gc unwrapped and recycled, never Fetch,</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">if we have a Fetch slice then something has gone very wrong.</span>
          <span style="color: #a626a4;">if</span> (<span style="font-weight: bold;">!</span>slice.isUnwrapped() &amp;&amp; slice.info.state != <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Recycled)
            <span style="color: #a626a4;">throw</span>
              <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error(<span style="color: #50a14f;">"Trying to garbage collect "</span>
                                <span style="color: #50a14f;">" a non-unwrapped slice! "</span>
                                + pretty_print(&amp;slice)
                                + pretty_print(slice.info));

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">it can be that our slice is ready, but it has some hanging</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">references lying around in the form of a recycled slice.</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Of course if we need the recycled slice the next iteration</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">this would be fatal, because we would then free the pointer</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">of the slice and at some point in the future we would</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">overwrite it. Therefore, we must check if slice has some</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">references in slices and if so then</span>
          <span style="color: #a0a1a7; font-weight: bold;">//</span>
          <span style="color: #a0a1a7; font-weight: bold;">//  </span><span style="color: #a0a1a7;">- we should mark those references as the original (since the data</span>
          <span style="color: #a0a1a7; font-weight: bold;">//    </span><span style="color: #a0a1a7;">pointer should be the same)</span>
          <span style="color: #a0a1a7; font-weight: bold;">//</span>
          <span style="color: #a0a1a7; font-weight: bold;">//  </span><span style="color: #a0a1a7;">- we should make sure that the data pointer of slice</span>
          <span style="color: #a0a1a7; font-weight: bold;">//    </span><span style="color: #a0a1a7;">does not get freed.</span>
          <span style="color: #a0a1a7; font-weight: bold;">//</span>
          <span style="color: #a626a4;">if</span> (slice.info.state == <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Ready) {
            <span style="color: #c18401;">WITH_OCD</span> <span style="color: #8b4513;">WITH_RANK</span>
              &lt;&lt; <span style="color: #50a14f;">"__gc__:"</span> &lt;&lt; <span style="color: #50a14f;">"checking for data recycled dependencies\n"</span>;
            <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">recycled</span>
              = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::hasRecycledReferencingToIt(slices, slice.info);
            <span style="color: #a626a4;">if</span> (recycled.size()) {
              <span style="color: #c18401;">Slice</span>* <span style="color: #8b4513;">newReady</span> = recycled[0];
              <span style="color: #c18401;">WITH_OCD</span> <span style="color: #8b4513;">WITH_RANK</span>
                &lt;&lt; <span style="color: #50a14f;">"__gc__:"</span> &lt;&lt; <span style="color: #50a14f;">"swaping recycled "</span>
                &lt;&lt; pretty_print(newReady-&gt;info)
                &lt;&lt; <span style="color: #50a14f;">" and "</span>
                &lt;&lt; pretty_print(slice.info)
                &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
              newReady-&gt;markReady();
              assert(newReady-&gt;data == slice.data);
              freeSlicePointer = <span style="font-weight: bold; text-decoration: underline;">false</span>;

              <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 1; i &lt; recycled.size(); i++) {
                <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">newRecyled</span> = recycled[i];
                newRecyled-&gt;info.recycling = newReady-&gt;info.type;
                <span style="color: #c18401;">WITH_OCD</span> <span style="color: #8b4513;">WITH_RANK</span>
                  &lt;&lt; <span style="color: #50a14f;">"__gc__:"</span> &lt;&lt; <span style="color: #50a14f;">"updating recycled "</span>
                  &lt;&lt; pretty_print(newRecyled-&gt;info)
                  &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
              }

            }
          }

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">if the slice is self sufficient, do not dare touching the</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">pointer, since it is a pointer to our sources in our rank.</span>
          <span style="color: #a626a4;">if</span> (  slice.info.state == <span style="font-weight: bold; text-decoration: underline;">Slice</span>::SelfSufficient
             || slice.info.state == <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Recycled
             ) {
            freeSlicePointer = <span style="font-weight: bold; text-decoration: underline;">false</span>;
          }

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">make sure we get its data pointer to be used later</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">only for non-recycled, since it can be that we need</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">for next iteration the data of the slice that the recycled points</span>
          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">to</span>
          <span style="color: #a626a4;">if</span> (freeSlicePointer) {
            freePointers.insert(slice.data);
            WITH_RANK &lt;&lt; <span style="color: #50a14f;">"~~~:cl("</span> &lt;&lt; name &lt;&lt; <span style="color: #50a14f;">")"</span>
                      &lt;&lt; <span style="color: #50a14f;">" added to freePointer "</span>
                      &lt;&lt; pretty_print(freePointers)
                      &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
          } <span style="color: #a626a4;">else</span> {
            <span style="color: #c18401;">WITH_OCD</span> <span style="color: #8b4513;">WITH_RANK</span> &lt;&lt; <span style="color: #50a14f;">"__gc__:not touching the free Pointer\n"</span>;
          }

          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">at this point, let us blank the slice</span>
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"~~~:cl("</span> &lt;&lt; name &lt;&lt; <span style="color: #50a14f;">")"</span>
                    &lt;&lt; <span style="color: #50a14f;">" freeing up slice "</span>
                    &lt;&lt; <span style="color: #50a14f;">" info "</span> &lt;&lt; slice.info
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
          slice.free();
        }

      }
    }

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">CONSTRUCTOR</span>
    <span style="color: #0184bc;">SliceUnion</span>( <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">sourceTensor</span>
              , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Type</span>&gt; <span style="color: #8b4513;">sliceTypes_</span>
              , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt; <span style="color: #8b4513;">sliceLength_</span>
              , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt; <span style="color: #8b4513;">paramLength</span>
              , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np</span>
              , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">child_world</span>
              , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">global_world</span>
              , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Name</span> <span style="color: #8b4513;">name_</span>
              , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nSliceBuffers</span> = 4
              )
              : rankMap(paramLength, np, global_world)
              , world(child_world)
              , universe(global_world)
              , sliceLength(sliceLength_)
              , sources(rankMap.nSources(),
                        <span style="font-weight: bold; text-decoration: underline;">std</span>::vector&lt;<span style="color: #c18401;">F</span>&gt;
                          (<span style="font-weight: bold; text-decoration: underline;">std</span>::accumulate(sliceLength.begin(),
                                           sliceLength.end(),
                                           1UL, <span style="font-weight: bold; text-decoration: underline;">std</span>::multiplies&lt;<span style="color: #c18401;">size_t</span>&gt;())))
              , name(name_)
              , sliceTypes(sliceTypes_)
              , sliceBuffers(nSliceBuffers, sources[0])
              <span style="color: #a0a1a7; font-weight: bold;">//</span><span style="color: #a0a1a7;">, slices(2 * sliceTypes.size(), Slice{ sources[0].size() })</span>
    { <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">constructor begin</span>

      LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"INIT SliceUnion: "</span> &lt;&lt; name &lt;&lt; <span style="color: #50a14f;">"\n"</span>;

      slices
        = <span style="font-weight: bold; text-decoration: underline;">std</span>::vector&lt;<span style="color: #c18401;">Slice</span>&gt;(2 * sliceTypes.size(), { sources[0].size() });
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: think exactly ^------------------- about this number</span>

      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">initialize the freePointers with the pointers to the buffers</span>
      <span style="font-weight: bold; text-decoration: underline;">std</span>::transform(sliceBuffers.begin(), sliceBuffers.end(),
                     <span style="font-weight: bold; text-decoration: underline;">std</span>::inserter(freePointers, freePointers.begin()),
                     [](<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">F</span>&gt; &amp;<span style="color: #8b4513;">vec</span>) { <span style="color: #a626a4;">return</span> vec.data(); });



      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"rankMap.nSources "</span>
                           &lt;&lt; rankMap.nSources() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#slices "</span>
                           &lt;&lt; slices.size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#slices[0] "</span>
                           &lt;&lt; slices[0].size &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#sources "</span>
                           &lt;&lt; sources.size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#sources[0] "</span>
                           &lt;&lt; sources[0].size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#freePointers "</span>
                           &lt;&lt; freePointers.size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#sliceBuffers "</span>
                           &lt;&lt; sliceBuffers.size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#sliceBuffers[0] "</span>
                           &lt;&lt; sliceBuffers[0].size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#sliceLength "</span>
                           &lt;&lt; sliceLength.size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#paramLength "</span>
                           &lt;&lt; paramLength.size() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"GB*"</span> &lt;&lt; np &lt;&lt; <span style="color: #50a14f;">" "</span>
                           &lt;&lt; <span style="color: #c18401;">double</span>(sources.size() + sliceBuffers.size())
                            * sources[0].size()
                            * 8 * np
                            / 1073741824.0
                           &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
    } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">constructor ends</span>

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">init</span>(<span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">sourceTensor</span>) {

      <span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">World</span> <span style="color: #8b4513;">w</span>(world);
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">rank</span> = <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank
              , <span style="color: #8b4513;">order</span> = sliceLength.size()
              ;
      <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int</span>&gt; <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">syms</span>(order, NS);
      <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int</span>&gt; <span style="color: #8b4513;">__sliceLength</span>(sliceLength.begin(), sliceLength.end());
      <span style="color: #c18401;">Tensor</span> <span style="color: #8b4513;">toSliceInto</span>(order,
                         __sliceLength.data(),
                         syms.data(),
                         w);
      LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"slicing... \n"</span>;

      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">setUp sources</span>
      <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">it</span>(0); it &lt; rankMap.nSources(); ++it) {
        <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span>
          <span style="color: #8b4513;">source</span> = rankMap.isSourcePadding(rank, source) ? 0 : it;
        <span style="color: #c18401;">WITH_OCD</span>
        <span style="color: #8b4513;">WITH_RANK</span>
          &lt;&lt; <span style="color: #50a14f;">"Init:toSliceInto it-"</span> &lt;&lt; it
          &lt;&lt; <span style="color: #50a14f;">" :: source "</span> &lt;&lt; source &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
        sliceIntoBuffer(source, toSliceInto, sourceTensor);
      }

    }

    <span style="color: #50a14f; font-style: italic;">/**</span>
<span style="color: #50a14f; font-style: italic;">     * \brief Send asynchronously only if the state is Fetch</span>
<span style="color: #50a14f; font-style: italic;">     */</span>
    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">send</span>( <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">otherRank</span>
             , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">LocalDatabaseElement</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">el</span>
             , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">tag</span>) <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #c18401;">MPI_Request</span> <span style="color: #8b4513;">request</span>;
      <span style="color: #c18401;">bool</span> <span style="color: #8b4513;">sendData_p</span> = <span style="font-weight: bold; text-decoration: underline;">false</span>;
      <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">info</span> = el.info;

      <span style="color: #a626a4;">if</span> (info.state == <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Fetch) sendData_p = <span style="font-weight: bold; text-decoration: underline;">true</span>;
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: remove this because I have SelfSufficient</span>
      <span style="color: #a626a4;">if</span> (otherRank == info.from.rank)      sendData_p = <span style="font-weight: bold; text-decoration: underline;">false</span>;
      <span style="color: #a626a4;">if</span> (<span style="font-weight: bold;">!</span>sendData_p) <span style="color: #a626a4;">return</span>;

      <span style="color: #a626a4;">switch</span> (el.name) {
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="font-weight: bold; text-decoration: underline;">Name</span>::TA:
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="font-weight: bold; text-decoration: underline;">Name</span>::VIJKA:
          <span style="color: #a626a4;">if</span> (otherRank / 48 == <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank / 48) {
            <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::localSend++;
          } <span style="color: #a626a4;">else</span> {
            <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::networkSend++;
          }
      }

      MPI_Isend( <span style="color: #c18401;">sources</span>[info.from.source].data()
               , <span style="color: #c18401;">sources</span>[info.from.source].size()
               , MPI_DOUBLE <span style="color: #a0a1a7; font-weight: bold;">/* </span><span style="color: #a0a1a7;">TODO: adapt this with traits</span><span style="color: #a0a1a7; font-weight: bold;"> */</span>
               , otherRank
               , tag
               , universe
               , &amp;request
               );
      <span style="color: #c18401;">WITH_CRAZY_DEBUG</span>
      <span style="color: #8b4513;">WITH_RANK</span> &lt;&lt; <span style="color: #50a14f;">"sent to "</span> &lt;&lt; otherRank &lt;&lt; <span style="color: #50a14f;">"\n"</span>;

    }

    <span style="color: #50a14f; font-style: italic;">/**</span>
<span style="color: #50a14f; font-style: italic;">     * \brief Receive asynchronously only if the state is Fetch</span>
<span style="color: #50a14f; font-style: italic;">     */</span>
    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">receive</span>(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Info</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">info</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">tag</span>) <span style="color: #a626a4;">noexcept</span> {
      <span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">slice</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::findByInfo(slices, info);

      <span style="color: #a626a4;">if</span> (<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank == info.from.rank) <span style="color: #a626a4;">return</span>;

      <span style="color: #a626a4;">if</span> (slice.info.state == <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Fetch) {
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: do it through the slice class</span>
        slice.info.state = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Dispatched;
        <span style="color: #c18401;">MPI_Request</span> <span style="color: #8b4513;">request</span>;
        slice.request = request;
        MPI_Irecv( slice.data
                 , slice.size
                 , MPI_DOUBLE <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: Adapt this with traits</span>
                 , info.from.rank
                 , tag
                 , universe
                 , &amp;slice.request
                <span style="color: #a0a1a7; font-weight: bold;">//</span><span style="color: #a0a1a7;">, MPI_STATUS_IGNORE</span>
                 );
      }
    }

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">unwrapAll</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>) {
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">type</span>: sliceTypes) unwrapSlice(type, abc);
    }

    <span style="color: #c18401;">F</span>* <span style="color: #0184bc;">unwrapSlice</span>(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Type</span> <span style="color: #8b4513;">type</span>, <span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>) {
      <span style="color: #c18401;">WITH_CRAZY_DEBUG</span>
      <span style="color: #8b4513;">WITH_RANK</span> &lt;&lt; <span style="color: #50a14f;">"__unwrap__:slice "</span> &lt;&lt; type &lt;&lt; <span style="color: #50a14f;">" w n "</span>
                &lt;&lt; name
                &lt;&lt; <span style="color: #50a14f;">" abc"</span> &lt;&lt; pretty_print(abc)
                &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      <span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">slice</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::findByTypeAbc(slices, type, abc);
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__unwrap__:info "</span> &lt;&lt; slice.info &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      <span style="color: #a626a4;">switch</span>  (slice.info.state) {
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Dispatched:
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__unwrap__:Fetch: "</span> &lt;&lt; &amp;slice
                    &lt;&lt; <span style="color: #50a14f;">" info "</span> &lt;&lt; pretty_print(slice.info)
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
          slice.unwrapAndMarkReady();
          <span style="color: #a626a4;">return</span> slice.data;
          <span style="color: #a626a4;">break</span>;
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::SelfSufficient:
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__unwrap__:SelfSufficient: "</span> &lt;&lt; &amp;slice
                    &lt;&lt; <span style="color: #50a14f;">" info "</span> &lt;&lt; pretty_print(slice.info)
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
          <span style="color: #a626a4;">return</span> slice.data;
          <span style="color: #a626a4;">break</span>;
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Ready:
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__unwrap__:READY: UNWRAPPED ALREADY"</span> &lt;&lt; &amp;slice
                    &lt;&lt; <span style="color: #50a14f;">" info "</span> &lt;&lt; pretty_print(slice.info)
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
          <span style="color: #a626a4;">return</span> slice.data;
          <span style="color: #a626a4;">break</span>;
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Recycled:
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__unwrap__:RECYCLED "</span> &lt;&lt; &amp;slice
                    &lt;&lt; <span style="color: #50a14f;">" info "</span> &lt;&lt; pretty_print(slice.info)
                    &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
          <span style="color: #a626a4;">return</span> unwrapSlice(slice.info.recycling, abc);
          <span style="color: #a626a4;">break</span>;
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Fetch:
        <span style="color: #a626a4;">case</span> <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Acceptor:
          <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error(<span style="color: #50a14f;">"Can't unwrap an acceptor or fetch slice!"</span>);
          <span style="color: #a626a4;">break</span>;
        <span style="color: #a626a4;">default</span>:
          <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error(<span style="color: #50a14f;">"Unknown error unwrapping slice!"</span>);
      }
      <span style="color: #a626a4;">return</span> slice.data;
    }

    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">RankMap</span> <span style="color: #8b4513;">rankMap</span>;
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">world</span>;
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">universe</span>;
    <span style="color: #a626a4;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt; <span style="color: #8b4513;">sliceLength</span>;
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">F</span>&gt; &gt; <span style="color: #8b4513;">sources</span>;
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt; <span style="color: #c18401;">Slice</span> &gt; <span style="color: #8b4513;">slices</span>;
    <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Name</span> <span style="color: #8b4513;">name</span>;
    <span style="color: #a626a4;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Type</span>&gt; <span style="color: #8b4513;">sliceTypes</span>;
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">F</span>&gt; &gt; <span style="color: #8b4513;">sliceBuffers</span>;
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">set</span>&lt;<span style="color: #c18401;">F</span>*&gt; <span style="color: #8b4513;">freePointers</span>;

  };

  <span style="color: #c18401;">SliceUnion</span>&amp;
  <span style="color: #0184bc;">unionByName</span>(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">SliceUnion</span>*&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">unions</span>, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Name</span> <span style="color: #8b4513;">name</span>) {
      <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">sliceUnionIt</span>
        = <span style="font-weight: bold; text-decoration: underline;">std</span>::find_if(unions.begin(), unions.end(),
                      [&amp;<span style="color: #8b4513;">name</span>](<span style="color: #c18401;">SliceUnion</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">s</span>) {
                        <span style="color: #a626a4;">return</span> name == s-&gt;name;
                      });
      <span style="color: #a626a4;">if</span> (sliceUnionIt == unions.end()) {
        <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">stringstream</span> <span style="color: #8b4513;">stream</span>;
        stream &lt;&lt; <span style="color: #50a14f;">"SliceUnion("</span> &lt;&lt; name &lt;&lt; <span style="color: #50a14f;">") not found!"</span>;
        <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error(stream.str());
      }
      <span style="color: #a626a4;">return</span> **sliceUnionIt;
  }

}
</pre>
</div>
</div>
</div>
