atrip.html

<div id="outline-container-org375c7fb" class="outline-2">
<h2 id="org375c7fb"><span class="section-number-2">6</span> Tuples</h2>
<div class="outline-text-2" id="text-6">
<p>
This section introduces the types for tuples \( (a,b,c) \)
as well as their distribution to nodes and cores.
</p>
</div>


<div id="outline-container-org3b4df16" class="outline-3">
<h3 id="org3b4df16"><span class="section-number-3">6.1</span> Tuples types</h3>
<div class="outline-text-3" id="text-6-1">
<p>
The main tuple types are simple type aliases for finite-size arrays.
A tuple is thus simply 3 natural numbers \( (a,b,c) \)
whereas a partial tuple is a two dimensional subset of these three.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">using</span> <span style="color: #c18401;">ABCTuple</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">array</span>&lt;<span style="color: #c18401;">size_t</span>, 3&gt;;
<span style="color: #a626a4;">using</span> <span style="color: #c18401;">PartialTuple</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">array</span>&lt;<span style="color: #c18401;">size_t</span>, 2&gt;;
<span style="color: #a626a4;">using</span> <span style="color: #c18401;">ABCTuples</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;ABCTuple&gt;;

<span style="color: #a626a4;">constexpr</span> <span style="color: #c18401;">ABCTuple</span> <span style="color: #8b4513;">FAKE_TUPLE</span> = {0, 0, 0};
<span style="color: #a626a4;">constexpr</span> <span style="color: #c18401;">ABCTuple</span> <span style="color: #8b4513;">INVALID_TUPLE</span> = {1, 1, 1};
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc95eb8b" class="outline-3">
<h3 id="orgc95eb8b"><span class="section-number-3">6.2</span> Distributing the tuples</h3>
<div class="outline-text-3" id="text-6-2">
<p>
In general it is our task to distribute all the tuples
\( (a,b,c) \) among the ranks. Every distribution should
make sure to allocate the same amount of tuples to every rank,
padding the list with <code>FAKE_TUPLE</code> elements as necessary.
</p>

<p>
The interface that we propose for this is simplye
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">struct</span> <span style="color: #c18401;">TuplesDistribution</span> {
  <span style="color: #a626a4;">virtual</span> <span style="color: #c18401;">ABCTuples</span> <span style="color: #0184bc;">getTuples</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>, <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">universe</span>) = 0;
  <span style="color: #a626a4;">virtual</span> <span style="color: #c18401;">bool</span> <span style="color: #0184bc;">tupleIsFake</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">t</span>) { <span style="color: #a626a4;">return</span> t == FAKE_TUPLE; }
};
</pre>
</div>
</div>
</div>
