atrip.html



<div id="outline-container-org695308f" class="outline-3">
<h3 id="org695308f"><span class="section-number-3">6.3</span> Node information</h3>
<div class="outline-text-3" id="text-6-3">
<dl class="org-dl">
<dt>nodeList</dt><dd>List of hostnames of size \( N_n \)</dd>
<dt>nodeInfos</dt><dd>List of (hostname, local rank Id)
of size \( N_p \), i.e., size of ranks
where local rank id goes from 0 to 48.</dd>
</dl>



<p>
<code>getNodeNames</code> gets the names of the nodes used,
i.e., the size of the resulting vector gives the
number of nodes.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::string&gt; <span style="color: #0184bc;">getNodeNames</span>(<span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">comm</span>){
  <span style="color: #c18401;">int</span> <span style="color: #8b4513;">rank</span>, <span style="color: #8b4513;">np</span>;
  MPI_Comm_rank(comm, &amp;rank);
  MPI_Comm_size(comm, &amp;np);

  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::string&gt; <span style="color: #8b4513;">nodeList</span>(np);
  <span style="color: #c18401;">char</span> <span style="color: #8b4513;">nodeName</span>[MPI_MAX_PROCESSOR_NAME]
     , <span style="color: #8b4513;">nodeNames</span>[np*MPI_MAX_PROCESSOR_NAME]
     ;
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int</span>&gt; <span style="color: #8b4513;">nameLengths</span>(np)
                 , <span style="color: #8b4513;">off</span>(np)
                 ;
  <span style="color: #c18401;">int</span> <span style="color: #8b4513;">nameLength</span>;
  MPI_Get_processor_name(nodeName, &amp;nameLength);
  MPI_Allgather(&amp;nameLength,
                1,
                MPI_INT,
                nameLengths.data(),
                1,
                MPI_INT,
                comm);
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">int</span> <span style="color: #8b4513;">i</span>(1); i &lt; np; i++)
    off[i] = off[i-1] + nameLengths[i-1];
  MPI_Allgatherv(nodeName,
                 nameLengths[rank],
                 MPI_BYTE,
                 nodeNames,
                 nameLengths.data(),
                 off.data(),
                 MPI_BYTE,
                 comm);
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">int</span> <span style="color: #8b4513;">i</span>(0); i &lt; np; i++) {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">string</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">s</span>(&amp;nodeNames[off[i]], <span style="color: #c18401;">nameLengths</span>[i]);
    nodeList[i] = s;
  }
  <span style="color: #a626a4;">return</span> nodeList;
}
</pre>
</div>

<p>
<code>getNodeInfos</code>
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">struct</span> <span style="color: #c18401;">RankInfo</span> {
  <span style="color: #a626a4;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">string</span> <span style="color: #8b4513;">name</span>;
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nodeId</span>;
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">globalRank</span>;
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">localRank</span>;
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">ranksPerNode</span>;
};

<span style="color: #a626a4;">template</span> &lt;<span style="color: #a626a4;">typename</span> <span style="color: #c18401;">A</span>&gt;
<span style="color: #c18401;">A</span> <span style="color: #0184bc;">unique</span>(<span style="color: #c18401;">A</span> <span style="color: #a626a4;">const</span> &amp;<span style="color: #8b4513;">xs</span>) {
  <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">result</span> = xs;
  <span style="font-weight: bold; text-decoration: underline;">std</span>::sort(<span style="font-weight: bold; text-decoration: underline;">std</span>::begin(result), <span style="font-weight: bold; text-decoration: underline;">std</span>::end(result));
  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">last</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::unique(<span style="font-weight: bold; text-decoration: underline;">std</span>::begin(result), <span style="font-weight: bold; text-decoration: underline;">std</span>::end(result));
  result.erase(last, <span style="font-weight: bold; text-decoration: underline;">std</span>::end(result));
  <span style="color: #a626a4;">return</span> result;
}

<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">RankInfo</span>&gt;
<span style="color: #0184bc;">getNodeInfos</span>(<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">string</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">nodeNames</span>) {
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">RankInfo</span>&gt; <span style="color: #8b4513;">result</span>;
  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">uniqueNames</span> = unique(nodeNames);
  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">index</span> = [&amp;<span style="color: #8b4513;">uniqueNames</span>](<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">string</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">s</span>) {
    <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">it</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::find(uniqueNames.begin(), uniqueNames.end(), s);
    <span style="color: #a626a4;">return</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::distance(uniqueNames.begin(), it);
  };
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt; <span style="color: #8b4513;">localRanks</span>(uniqueNames.size(), 0);
  <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">globalRank</span> = 0;
  <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">name</span>: nodeNames) {
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nodeId</span> = index(name);
    result.push_back({name,
                      nodeId,
                      globalRank++,
                      localRanks[nodeId]++,
                      <span style="font-weight: bold; text-decoration: underline;">std</span>::count(nodeNames.begin(),
                                 nodeNames.end(),
                                 name)
                      });
  }
  <span style="color: #a626a4;">return</span> result;
}

<span style="color: #a626a4;">struct</span> <span style="color: #c18401;">ClusterInfo</span> {
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nNodes</span>, <span style="color: #8b4513;">np</span>, <span style="color: #8b4513;">ranksPerNode</span>;
  <span style="color: #a626a4;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">RankInfo</span>&gt; <span style="color: #8b4513;">rankInfos</span>;
};

<span style="color: #c18401;">ClusterInfo</span>
<span style="color: #0184bc;">getClusterInfo</span>(<span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">comm</span>) {
  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">names</span> = getNodeNames(comm);
  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">rankInfos</span> = getNodeInfos(names);

  <span style="color: #a626a4;">return</span> ClusterInfo {
    unique(names).size(),
    names.size(),
    rankInfos[0].ranksPerNode,
    rankInfos
  };

}
</pre>
</div>
</div>
</div>
