atrip.html

<div id="outline-container-org1e569f8" class="outline-3">
<h3 id="org1e569f8"><span class="section-number-3">6.4</span> Naive list</h3>
<div class="outline-text-3" id="text-6-4">
<p>
The naive implementation of the global tuples list is simple
three for loops creating tuples of the sort
\( (a,b,c) \) where the following conditions are met at the same time:
</p>
<ul class="org-ul">
<li>\( a \leq b \leq c \)</li>
<li>\(
  a \neq b \land b \neq c
  \)</li>
</ul>

<p>
This means,
\( (1, 2, 3)
 , (1, 1, 3)
 , (1, 2, 2)
\) are acceptable tuples wherease \( (2, 1, 1) \) and \( (1, 1, 1) \) are not.
</p>


<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c18401;">ABCTuples</span> <span style="color: #0184bc;">getTuplesList</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">rank</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np</span>) {

  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">total number of tuples for the problem</span>
       <span style="color: #8b4513;">n</span> = Nv * (Nv + 1) * (Nv + 2) / 6 - Nv

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">all ranks should have the same number of tuples_per_rank</span>
    , <span style="color: #8b4513;">tuples_per_rank</span> = n / np + size_t(n % np != 0)

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">start index for the global tuples list</span>
    , <span style="color: #8b4513;">start</span> = tuples_per_rank * rank

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">end index for the global tuples list</span>
    , <span style="color: #8b4513;">end</span> = tuples_per_rank * (rank + 1)
    ;

  LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"tuples_per_rank = "</span> &lt;&lt; tuples_per_rank &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  WITH_RANK &lt;&lt; <span style="color: #50a14f;">"start, end = "</span> &lt;&lt; start &lt;&lt; <span style="color: #50a14f;">", "</span> &lt;&lt; end &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  <span style="color: #c18401;">ABCTuples</span> <span style="color: #8b4513;">result</span>(tuples_per_rank, FAKE_TUPLE);

  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">a</span>(0), <span style="color: #8b4513;">r</span>(0), <span style="color: #8b4513;">g</span>(0); a &lt; Nv; a++)
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">b</span>(a);             b &lt; Nv; b++)
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">c</span>(b);             c &lt; Nv; c++){
    <span style="color: #a626a4;">if</span> ( a == b &amp;&amp; b == c ) <span style="color: #a626a4;">continue</span>;
    <span style="color: #a626a4;">if</span> ( start &lt;= g &amp;&amp; g &lt; end) result[r++] = {a, b, c};
    g++;
  }

  <span style="color: #a626a4;">return</span> result;

}
</pre>
</div>

<p>
and all tuples would simply be
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c18401;">ABCTuples</span> <span style="color: #0184bc;">getAllTuplesList</span>(<span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>) {
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">n</span> = Nv * (Nv + 1) * (Nv + 2) / 6 - Nv;
  <span style="color: #c18401;">ABCTuples</span> <span style="color: #8b4513;">result</span>(n);

  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">a</span>(0), <span style="color: #8b4513;">u</span>(0); a &lt; Nv; a++)
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">b</span>(a); b &lt; Nv; b++)
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">c</span>(b); c &lt; Nv; c++){
    <span style="color: #a626a4;">if</span> ( a == b &amp;&amp; b == c ) <span style="color: #a626a4;">continue</span>;
    result[u++] = {a, b, c};
  }

  <span style="color: #a626a4;">return</span> result;
}
</pre>
</div>


<p>
With <code>getTupleList</code> we can easily define a tuple distribution like
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">struct</span> <span style="color: #c18401;">NaiveDistribution</span> : <span style="color: #a626a4;">public</span> <span style="color: #c18401;">TuplesDistribution</span> {
  <span style="color: #c18401;">ABCTuples</span> <span style="color: #0184bc;">getTuples</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>, <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">universe</span>) <span style="color: #a626a4;">override</span> {
    <span style="color: #c18401;">int</span> <span style="color: #8b4513;">rank</span>, <span style="color: #8b4513;">np</span>;
    MPI_Comm_rank(universe, &amp;rank);
    MPI_Comm_size(universe, &amp;np);
    <span style="color: #a626a4;">return</span> getTuplesList(Nv, (<span style="color: #c18401;">size_t</span>)rank, (<span style="color: #c18401;">size_t</span>)np);
  }
};
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb60e8a6" class="outline-3">
<h3 id="orgb60e8a6"><span class="section-number-3">6.5</span> Group and sort list</h3>
<div class="outline-text-3" id="text-6-5">
</div>
<div id="outline-container-orge92957a" class="outline-4">
<h4 id="orge92957a"><span class="section-number-4">6.5.1</span> Utils</h4>
<div class="outline-text-4" id="text-6-5-1">
<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Provides the node on which the slice-element is found</span>
<span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Right now we distribute the slices in a round robin fashion</span>
<span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">over the different nodes (NOTE: not mpi ranks but nodes)</span>
<span style="color: #a626a4;">inline</span>
<span style="color: #c18401;">size_t</span> <span style="color: #0184bc;">isOnNode</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">tuple</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nNodes</span>) { <span style="color: #a626a4;">return</span> tuple % nNodes; }


<span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">return the node (or all nodes) where the elements of this</span>
<span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">tuple are located</span>
<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt; <span style="color: #0184bc;">getTupleNodes</span>(<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">t</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nNodes</span>) {
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">size_t</span>&gt;
    <span style="color: #8b4513;">nTuple</span> = { isOnNode(t[0], nNodes)
             , isOnNode(t[1], nNodes)
             , isOnNode(t[2], nNodes)
             };
  <span style="color: #a626a4;">return</span> unique(nTuple);
}

<span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Info</span> {
  <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nNodes</span>;
  <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nodeId</span>;
};

</pre>
</div>
</div>
</div>
