atrip.html

<div id="outline-container-org76a9e9b" class="outline-4">
<h4 id="org76a9e9b"><span class="section-number-4">6.5.2</span> Distribution</h4>
<div class="outline-text-4" id="text-6-5-2">
<p>
wording: home element = element which is located on the given node
</p>
<ol class="org-ol">
<li>we distribute the tuples such that each tuple has at least one 'home element'</li>
<li>we sort each tuple in a way that the 'home element' are the fastest indices</li>
<li>we sort the list of tuples on every node</li>
<li>we resort the tuples that for every tuple abc the following holds: a&lt;b&lt;c</li>
</ol>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c18401;">ABCTuples</span> <span style="color: #0184bc;">specialDistribution</span>(<span style="color: #c18401;">Info</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">info</span>, <span style="color: #c18401;">ABCTuples</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">allTuples</span>) {

  <span style="color: #c18401;">ABCTuples</span> <span style="color: #8b4513;">nodeTuples</span>;
  <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">nNodes</span>(info.nNodes);

  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">ABCTuples</span>&gt;
      <span style="color: #8b4513;">container1d</span>(nNodes)
    , <span style="color: #8b4513;">container2d</span>(nNodes * nNodes)
    , <span style="color: #8b4513;">container3d</span>(nNodes * nNodes * nNodes)
    ;

  <span style="color: #a626a4;">if</span> (info.nodeId == 0)
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"\tGoing through all "</span>
              &lt;&lt; allTuples.size()
              &lt;&lt; <span style="color: #50a14f;">" tuples in "</span>
              &lt;&lt; nNodes
              &lt;&lt; <span style="color: #50a14f;">" nodes\n"</span>;

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">build container-n-d's</span>
  <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">t</span>: allTuples) {
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">one which node(s) are the tuple elements located...</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">put them into the right container</span>
    <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">_nodes</span> = getTupleNodes(t, nNodes);

    <span style="color: #a626a4;">switch</span> (_nodes.size()) {
      <span style="color: #a626a4;">case</span> 1:
        container1d[_nodes[0]].push_back(t);
        <span style="color: #a626a4;">break</span>;
      <span style="color: #a626a4;">case</span> 2:
        container2d[ _nodes[0]
                   + _nodes[1] * nNodes
                   ].push_back(t);
        <span style="color: #a626a4;">break</span>;
      <span style="color: #a626a4;">case</span> 3:
        container3d[ _nodes[0]
                   + _nodes[1] * nNodes
                   + _nodes[2] * nNodes * nNodes
                   ].push_back(t);
        <span style="color: #a626a4;">break</span>;
    }

  }

  <span style="color: #a626a4;">if</span> (info.nodeId == 0)
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"\tBuilding 1-d containers\n"</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">DISTRIBUTE 1-d containers</span>
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">every tuple which is only located at one node belongs to this node</span>
  {
    <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">_tuples</span> = container1d[info.nodeId];
    nodeTuples.resize(_tuples.size(), INVALID_TUPLE);
    <span style="font-weight: bold; text-decoration: underline;">std</span>::copy(_tuples.begin(), _tuples.end(), nodeTuples.begin());
  }

  <span style="color: #a626a4;">if</span> (info.nodeId == 0)
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"\tBuilding 2-d containers\n"</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">DISTRIBUTE 2-d containers</span>
  <span style="color: #a0a1a7; font-weight: bold;">//</span><span style="color: #a0a1a7;">the tuples which are located at two nodes are half/half given to these nodes</span>
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">yx</span> = 0; yx &lt; container2d.size(); yx++) {

    <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">_tuples</span> = container2d[yx];
      <span style="color: #a626a4;">const</span>
    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">idx</span> = yx % nNodes
         <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">remeber: yx = idy * nNodes + idx</span>
         , <span style="color: #8b4513;">idy</span> = yx / nNodes
         , <span style="color: #8b4513;">n_half</span> = _tuples.size() / 2
         , <span style="color: #8b4513;">size</span> = nodeTuples.size()
         ;

    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nbeg</span>, <span style="color: #8b4513;">nend</span>;
    <span style="color: #a626a4;">if</span> (info.nodeId == idx) {
      nbeg = 0 * n_half;
      nend = n_half;
    } <span style="color: #a626a4;">else</span> <span style="color: #a626a4;">if</span> (info.nodeId == idy) {
      nbeg = 1 * n_half;
      nend = _tuples.size();
    } <span style="color: #a626a4;">else</span> {
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">either idx or idy is my node</span>
      <span style="color: #a626a4;">continue</span>;
    }

    <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">nextra</span> = nend - nbeg;
    nodeTuples.resize(size + nextra, INVALID_TUPLE);
    <span style="font-weight: bold; text-decoration: underline;">std</span>::copy(_tuples.begin() + nbeg,
              _tuples.begin() + nend,
              nodeTuples.begin() + size);

  }

  <span style="color: #a626a4;">if</span> (info.nodeId == 0)
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"\tBuilding 3-d containers\n"</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">DISTRIBUTE 3-d containers</span>
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">zyx</span> = 0; zyx &lt; container3d.size(); zyx++) {
    <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">_tuples</span> = container3d[zyx];

      <span style="color: #a626a4;">const</span>
    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">idx</span> = zyx % nNodes
         , <span style="color: #8b4513;">idy</span> = (zyx / nNodes) % nNodes
         <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">remember: zyx = idx + idy * nNodes + idz * nNodes^2</span>
         , <span style="color: #8b4513;">idz</span> = zyx / nNodes / nNodes
         , <span style="color: #8b4513;">n_third</span> = _tuples.size() / 3
         , <span style="color: #8b4513;">size</span> = nodeTuples.size()
         ;

    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nbeg</span>, <span style="color: #8b4513;">nend</span>;
    <span style="color: #a626a4;">if</span> (info.nodeId == idx) {
      nbeg = 0 * n_third;
      nend = 1 * n_third;
    } <span style="color: #a626a4;">else</span> <span style="color: #a626a4;">if</span> (info.nodeId == idy) {
      nbeg = 1 * n_third;
      nend = 2 * n_third;
    } <span style="color: #a626a4;">else</span> <span style="color: #a626a4;">if</span> (info.nodeId == idz) {
      nbeg = 2 * n_third;
      nend = _tuples.size();
    } <span style="color: #a626a4;">else</span> {
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">either idx or idy or idz is my node</span>
      <span style="color: #a626a4;">continue</span>;
    }

    <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">nextra</span> = nend - nbeg;
    nodeTuples.resize(size + nextra, INVALID_TUPLE);
    <span style="font-weight: bold; text-decoration: underline;">std</span>::copy(_tuples.begin() + nbeg,
              _tuples.begin() + nend,
              nodeTuples.begin() + size);

  }


  <span style="color: #a626a4;">if</span> (info.nodeId == 0) <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"\tswapping tuples...\n"</span>;
  <span style="color: #a0a1a7; font-weight: bold;">/*</span>
<span style="color: #a0a1a7;">   *  sort part of group-and-sort algorithm</span>
<span style="color: #a0a1a7;">   *  every tuple on a given node is sorted in a way that</span>
<span style="color: #a0a1a7;">   *  the 'home elements' are the fastest index.</span>
<span style="color: #a0a1a7;">   *  1:yyy 2:yyn(x) 3:yny(x) 4:ynn(x) 5:nyy 6:nyn(x) 7:nny 8:nnn</span>
<span style="color: #a0a1a7; font-weight: bold;">   */</span>
  <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> &amp;<span style="color: #8b4513;">nt</span>: nodeTuples){
    <span style="color: #a626a4;">if</span> ( isOnNode(nt[0], nNodes) == info.nodeId ){ <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">1234</span>
      <span style="color: #a626a4;">if</span> ( isOnNode(nt[2], nNodes) != info.nodeId ){ <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">24</span>
        <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">x</span>(nt[0]);
        nt[0] = nt[2];         <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">switch first and last</span>
        nt[2] = x;
      }
      <span style="color: #a626a4;">else</span> <span style="color: #a626a4;">if</span> ( isOnNode(nt[1], nNodes) != info.nodeId){ <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">3</span>
        <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">x</span>(nt[0]);
        nt[0] = nt[1];         <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">switch first two</span>
        nt[1] = x;
      }
    } <span style="color: #a626a4;">else</span> {
      <span style="color: #a626a4;">if</span> ( isOnNode(nt[1], nNodes) == info.nodeId   <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">56</span>
        &amp;&amp; isOnNode(nt[2], nNodes) != info.nodeId
        ) { <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">6</span>
        <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">x</span>(nt[1]);
        nt[1] = nt[2];         <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">switch last two</span>
        nt[2] = x;
      }
    }
  }

  <span style="color: #a626a4;">if</span> (info.nodeId == 0) <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"\tsorting list of tuples...\n"</span>;
  <span style="color: #a0a1a7; font-weight: bold;">//</span><span style="color: #a0a1a7;">now we sort the list of tuples</span>
  <span style="font-weight: bold; text-decoration: underline;">std</span>::sort(nodeTuples.begin(), nodeTuples.end());

  <span style="color: #a626a4;">if</span> (info.nodeId == 0) <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"\trestoring tuples...\n"</span>;
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">we bring the tuples abc back in the order a&lt;b&lt;c</span>
  <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> &amp;<span style="color: #8b4513;">t</span>: nodeTuples)  <span style="font-weight: bold; text-decoration: underline;">std</span>::sort(t.begin(), t.end());

<span style="color: #e44649;">#if</span> ATRIP_DEBUG &gt; 1
  <span style="color: #a626a4;">if</span> (info.nodeId == 0)
  <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="color: #50a14f;">"checking for validity of "</span> &lt;&lt; nodeTuples.size() &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::endl;
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">bool</span> <span style="color: #8b4513;">anyInvalid</span>
    = <span style="font-weight: bold; text-decoration: underline;">std</span>::any_of(nodeTuples.begin(),
                  nodeTuples.end(),
                  [](<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">t</span>) { <span style="color: #a626a4;">return</span> t == INVALID_TUPLE; });
  <span style="color: #a626a4;">if</span> (anyInvalid) <span style="color: #a626a4;">throw</span> <span style="color: #50a14f;">"Some tuple is invalid in group-and-sort algorithm"</span>;
<span style="color: #e44649;">#endif</span>

  <span style="color: #a626a4;">return</span> nodeTuples;

}
</pre>
</div>
</div>
</div>
