atrip.org
**** Main

The main routine should return the list of tuples to be handled by the current rank.

Let \( N_p \) be the number of ranks or processes.
Let \( N_n \) be the number of nodes or sockets.

Then we have the following

#+begin_example
Global rank | 0 1 2 3 4 5 6 7 8
key         | global rank
nodeId      | 0 1 0 1 1 0 2 2 2
Local rank  | 0 0 1 1 2 2 0 1 2
intra color | 0 1 0 1 1 0 2 2 2
#+end_example





#+begin_src c++ :tangle (atrip-tuples-h)
std::vector<ABCTuple> main(MPI_Comm universe, size_t Nv) {

  int rank, np;
  MPI_Comm_rank(universe, &rank);
  MPI_Comm_size(universe, &np);

  std::vector<ABCTuple> result;

  auto const nodeNames(getNodeNames(universe));
  size_t const nNodes = unique(nodeNames).size();
  auto const nodeInfos = getNodeInfos(nodeNames);

  // We want to construct a communicator which only contains of one
  // element per node
  bool const computeDistribution
    = nodeInfos[rank].localRank == 0;

  std::vector<ABCTuple>
    nodeTuples
      = computeDistribution
      ? specialDistribution(Info{nNodes, nodeInfos[rank].nodeId},
                            getAllTuplesList(Nv))
      : std::vector<ABCTuple>()
      ;

  LOG(1,"Atrip") << "got nodeTuples\n";

  // now we have to send the data from **one** rank on each node
  // to all others ranks of this node
    const
  int color = nodeInfos[rank].nodeId
    , key = nodeInfos[rank].localRank
    ;


  MPI_Comm INTRA_COMM;
  MPI_Comm_split(universe, color, key, &INTRA_COMM);
#+end_src

Every node has to distribute **at least**
=nodeTuples.size() / nodeInfos[rank].ranksPerNode=
tuples among the ranks.

We have to communicate this quantity among all nodes.

#+begin_src c++ :tangle (atrip-tuples-h)

  size_t const
    tuplesPerRankLocal
       = nodeTuples.size() / nodeInfos[rank].ranksPerNode
       + size_t(nodeTuples.size() % nodeInfos[rank].ranksPerNode != 0)
       ;

  size_t tuplesPerRankGlobal;

  MPI_Reduce(&tuplesPerRankLocal,
             &tuplesPerRankGlobal,
             1,
             MPI_UINT64_T,
             MPI_MAX,
             0,
             universe);

  MPI_Bcast(&tuplesPerRankGlobal,
            1,
            MPI_UINT64_T,
            0,
            universe);

  LOG(1,"Atrip") << "Tuples per rank: " << tuplesPerRankGlobal << "\n";
  LOG(1,"Atrip") << "ranks per node " << nodeInfos[rank].ranksPerNode << "\n";
  LOG(1,"Atrip") << "#nodes " << nNodes << "\n";
#+end_src

Now we have the tuples that every rank has to have, i.e.,
=tuplesPerRankGlobal=.

However before this,
the tuples in =nodeTuples= now have to be sent from the local rank
in every node to all the ranks in the given node,
and we have to make sure that every rank inside a given node
gets the same amount of tuples, in this case it should be
=tuplesPerRankLocal=, and in our node the total number
of tuples should be =tuplesPerRankLocal * nodeInfos[rank].ranksPerNode=,
however this might not be the case up to now due to divisibility issues.

Up to now we have exactly =nodeTuples.size()= tuples, we have to make sure by
resizing that the condition above is met, i.e., so we can resize
and add some fake tuples at the end as padding.

#+begin_src c++ :tangle (atrip-tuples-h)
size_t const totalTuples
  = tuplesPerRankGlobal * nodeInfos[rank].ranksPerNode;

if (computeDistribution) {
  // pad with FAKE_TUPLEs
  nodeTuples.insert(nodeTuples.end(),
                    totalTuples - nodeTuples.size(),
                    FAKE_TUPLE);
}
#+end_src

And now we can simply scatter the tuples in nodeTuples and send
=tuplesPerRankGlobal= to the different ranks in the node,

#+begin_src c++ :tangle (atrip-tuples-h)
{
  // construct mpi type for abctuple
  MPI_Datatype MPI_ABCTUPLE;
  MPI_Type_vector(nodeTuples[0].size(), 1, 1, MPI_UINT64_T, &MPI_ABCTUPLE);
  MPI_Type_commit(&MPI_ABCTUPLE);

  LOG(1,"Atrip") << "scattering tuples \n";

  result.resize(tuplesPerRankGlobal);
  MPI_Scatter(nodeTuples.data(),
              tuplesPerRankGlobal,
              MPI_ABCTUPLE,
              result.data(),
              tuplesPerRankGlobal,
              MPI_ABCTUPLE,
              0,
              INTRA_COMM);

  MPI_Type_free(&MPI_ABCTUPLE);

}
#+end_src


The next step is sending the tuples in the local root rank
to the other ranks in the node, this we do with the MPI function
=MPI_Scatterv=.
Every rank gets =tuplesPerRankLocal= tuples and
the =nodeTuples= vector is now homogeneous and divisible by the number
of ranks per node in our node.
Therefore, the =displacements= are simply the vector
\begin{equation*}
  \left\{
  k * \mathrm{tuplesPerNodeLocal}
  \mid
  k \in
  \left\{ 0
        , \ldots
        , \#\text{ranks in node} - 1
        \right\}
  \right\}
\end{equation*}

and the =sendCounts= vector is simply the constant vector
=tuplesPerRankLocal= of size =ranksPerNode=.

#+begin_src c++ :tangle (atrip-tuples-h)

  return result;

}
#+end_src

**** Interface

The distribution interface will then simply be

#+begin_src c++ :tangle (atrip-tuples-h)
struct Distribution : public TuplesDistribution {
  ABCTuples getTuples(size_t Nv, MPI_Comm universe) override {
    return main(universe, Nv);
  }
};
#+end_src


**** Epilog                                                        :noexport:
#+begin_src c++ :tangle (atrip-tuples-h)
} // namespace group_and_sort
#+end_src


*** Epilog                                                         :noexport:
#+begin_src c++ :tangle (atrip-tuples-h)
}
#+end_src

