atrip.html


<div id="outline-container-orge1a4493" class="outline-4">
<h4 id="orge1a4493"><span class="section-number-4">6.5.3</span> Main</h4>
<div class="outline-text-4" id="text-6-5-3">
<p>
The main routine should return the list of tuples to be handled by the current rank.
</p>

<p>
Let \( N_p \) be the number of ranks or processes.
Let \( N_n \) be the number of nodes or sockets.
</p>

<p>
Then we have the following
</p>

<pre class="example" id="orga5984e8">
Global rank | 0 1 2 3 4 5 6 7 8
key         | global rank
nodeId      | 0 1 0 1 1 0 2 2 2
Local rank  | 0 0 1 1 2 2 0 1 2
intra color | 0 1 0 1 1 0 2 2 2
</pre>





<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;ABCTuple&gt; <span style="color: #0184bc;">main</span>(<span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">universe</span>, <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>) {

  <span style="color: #c18401;">int</span> <span style="color: #8b4513;">rank</span>, <span style="color: #8b4513;">np</span>;
  MPI_Comm_rank(universe, &amp;rank);
  MPI_Comm_size(universe, &amp;np);

  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;ABCTuple&gt; <span style="color: #8b4513;">result</span>;

  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">nodeNames</span>(<span style="color: #c18401;">getNodeNames</span>(<span style="color: #8b4513;">universe</span>));
  <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">nNodes</span> = unique(nodeNames).size();
  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">nodeInfos</span> = getNodeInfos(nodeNames);

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">We want to construct a communicator which only contains of one</span>
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">element per node</span>
  <span style="color: #c18401;">bool</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">computeDistribution</span>
    = nodeInfos[rank].localRank == 0;

  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;ABCTuple&gt;
    <span style="color: #8b4513;">nodeTuples</span>
      = computeDistribution
      ? specialDistribution(Info{nNodes, nodeInfos[rank].nodeId},
                            getAllTuplesList(Nv))
      : <span style="font-weight: bold; text-decoration: underline;">std</span>::vector&lt;ABCTuple&gt;()
      ;

  LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"got nodeTuples\n"</span>;

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">now we have to send the data from **one** rank on each node</span>
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">to all others ranks of this node</span>
    <span style="color: #a626a4;">const</span>
  <span style="color: #c18401;">int</span> <span style="color: #8b4513;">color</span> = nodeInfos[rank].nodeId
    , <span style="color: #8b4513;">key</span> = nodeInfos[rank].localRank
    ;


  <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">INTRA_COMM</span>;
  MPI_Comm_split(universe, color, key, &amp;INTRA_COMM);
</pre>
</div>

<p>
Every node has to distribute <b><b>at least</b></b>
<code>nodeTuples.size() / nodeInfos[rank].ranksPerNode</code>
tuples among the ranks.
</p>

<p>
We have to communicate this quantity among all nodes.
</p>

<div class="org-src-container">
<pre class="src src-c++">
  <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span>
    <span style="color: #8b4513;">tuplesPerRankLocal</span>
       = nodeTuples.size() / nodeInfos[rank].ranksPerNode
       + size_t(nodeTuples.size() % nodeInfos[rank].ranksPerNode != 0)
       ;

  <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">tuplesPerRankGlobal</span>;

  MPI_Reduce(&amp;tuplesPerRankLocal,
             &amp;tuplesPerRankGlobal,
             1,
             MPI_UINT64_T,
             MPI_MAX,
             0,
             universe);

  MPI_Bcast(&amp;tuplesPerRankGlobal,
            1,
            MPI_UINT64_T,
            0,
            universe);

  LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"Tuples per rank: "</span> &lt;&lt; tuplesPerRankGlobal &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"ranks per node "</span> &lt;&lt; nodeInfos[rank].ranksPerNode &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#nodes "</span> &lt;&lt; nNodes &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
</pre>
</div>

<p>
Now we have the tuples that every rank has to have, i.e.,
<code>tuplesPerRankGlobal</code>.
</p>

<p>
However before this,
the tuples in <code>nodeTuples</code> now have to be sent from the local rank
in every node to all the ranks in the given node,
and we have to make sure that every rank inside a given node
gets the same amount of tuples, in this case it should be
<code>tuplesPerRankLocal</code>, and in our node the total number
of tuples should be <code>tuplesPerRankLocal * nodeInfos[rank].ranksPerNode</code>,
however this might not be the case up to now due to divisibility issues.
</p>

<p>
Up to now we have exactly <code>nodeTuples.size()</code> tuples, we have to make sure by
resizing that the condition above is met, i.e., so we can resize
and add some fake tuples at the end as padding.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">totalTuples</span>
  = tuplesPerRankGlobal * nodeInfos[rank].ranksPerNode;

<span style="color: #a626a4;">if</span> (computeDistribution) {
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">pad with FAKE_TUPLEs</span>
  nodeTuples.insert(nodeTuples.end(),
                    totalTuples - nodeTuples.size(),
                    FAKE_TUPLE);
}
</pre>
</div>

<p>
And now we can simply scatter the tuples in nodeTuples and send
<code>tuplesPerRankGlobal</code> to the different ranks in the node,
</p>

<div class="org-src-container">
<pre class="src src-c++">{
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">construct mpi type for abctuple</span>
  <span style="color: #c18401;">MPI_Datatype</span> <span style="color: #8b4513;">MPI_ABCTUPLE</span>;
  MPI_Type_vector(nodeTuples[0].size(), 1, 1, MPI_UINT64_T, &amp;MPI_ABCTUPLE);
  MPI_Type_commit(&amp;MPI_ABCTUPLE);

  LOG(1,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"scattering tuples \n"</span>;

  result.resize(tuplesPerRankGlobal);
  MPI_Scatter(nodeTuples.data(),
              tuplesPerRankGlobal,
              MPI_ABCTUPLE,
              result.data(),
              tuplesPerRankGlobal,
              MPI_ABCTUPLE,
              0,
              INTRA_COMM);

  MPI_Type_free(&amp;MPI_ABCTUPLE);

}
</pre>
</div>


<p>
The next step is sending the tuples in the local root rank
to the other ranks in the node, this we do with the MPI function
<code>MPI_Scatterv</code>.
Every rank gets <code>tuplesPerRankLocal</code> tuples and
the <code>nodeTuples</code> vector is now homogeneous and divisible by the number
of ranks per node in our node.
Therefore, the <code>displacements</code> are simply the vector
</p>
\begin{equation*}
  \left\{
  k * \mathrm{tuplesPerNodeLocal}
  \mid
  k \in
  \left\{ 0
        , \ldots
        , \#\text{ranks in node} - 1
        \right\}
  \right\}
\end{equation*}

<p>
and the <code>sendCounts</code> vector is simply the constant vector
<code>tuplesPerRankLocal</code> of size <code>ranksPerNode</code>.
</p>

<div class="org-src-container">
<pre class="src src-c++">
  <span style="color: #a626a4;">return</span> result;

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d25a54" class="outline-4">
<h4 id="org2d25a54"><span class="section-number-4">6.5.4</span> Interface</h4>
<div class="outline-text-4" id="text-6-5-4">
<p>
The distribution interface will then simply be
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Distribution</span> : <span style="color: #a626a4;">public</span> <span style="color: #c18401;">TuplesDistribution</span> {
  <span style="color: #c18401;">ABCTuples</span> <span style="color: #0184bc;">getTuples</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>, <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">universe</span>) <span style="color: #a626a4;">override</span> {
    <span style="color: #a626a4;">return</span> main(universe, Nv);
  }
};
</pre>
</div>
</div>
</div>
</div>
</div>
