atrip.html

<div id="outline-container-org41e273c" class="outline-2">
<h2 id="org41e273c"><span class="section-number-2">7</span> Unions</h2>
<div class="outline-text-2" id="text-7">
<p>
Every slice pertaining to every different tensor
is sliced differently.
</p>


<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#pragma</span> once
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/SliceUnion.hpp&gt;</span>

<span style="color: #a626a4;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span> {

  <span style="color: #c18401;">void</span> <span style="color: #0184bc;">sliceIntoVector</span>
    ( <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; &amp;<span style="color: #8b4513;">v</span>
    , <span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; &amp;<span style="color: #8b4513;">toSlice</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int64_t</span>&gt; <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">low</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int64_t</span>&gt; <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">up</span>
    , <span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">origin</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int64_t</span>&gt; <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">originLow</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int64_t</span>&gt; <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">originUp</span>
    ) {
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Thank you CTF for forcing me to do this</span>
    <span style="color: #a626a4;">struct</span> { <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">int</span>&gt; <span style="color: #8b4513;">up</span>, <span style="color: #8b4513;">low</span>; }
        <span style="color: #8b4513;">toSlice_</span> = { {up.begin(), up.end()}
                   , {low.begin(), low.end()} }
      , <span style="color: #8b4513;">origin_</span> = { {originUp.begin(), originUp.end()}
                  , {originLow.begin(), originLow.end()} }
      ;

    <span style="color: #c18401;">WITH_OCD</span>
    <span style="color: #8b4513;">WITH_RANK</span> &lt;&lt; <span style="color: #50a14f;">"slicing into "</span> &lt;&lt; pretty_print(toSlice_.up)
                          &lt;&lt; <span style="color: #50a14f;">","</span> &lt;&lt; pretty_print(toSlice_.low)
              &lt;&lt; <span style="color: #50a14f;">" from "</span> &lt;&lt; pretty_print(origin_.up)
                   &lt;&lt; <span style="color: #50a14f;">","</span> &lt;&lt; pretty_print(origin_.low)
              &lt;&lt; <span style="color: #50a14f;">"\n"</span>;

<span style="color: #e44649;">#if</span><span style="color: #e44649; font-weight: bold;">n</span><span style="color: #e44649;">def</span> ATRIP_DONT_SLICE
    toSlice.slice( toSlice_.low.data()
                 , toSlice_.up.data()
                 , 0.0
                 , origin
                 , origin_.low.data()
                 , origin_.up.data()
                 , 1.0);
    memcpy(v.data(), toSlice.data, <span style="color: #a626a4;">sizeof</span>(<span style="color: #c18401;">double</span>) * v.size());
<span style="color: #e44649;">#endif</span>

  }


  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">TAPHH</span> : <span style="color: #a626a4;">public</span> <span style="color: #c18401;">SliceUnion</span> {
    <span style="color: #0184bc;">TAPHH</span>( <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">sourceTensor</span>
         , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span>
         , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>
         , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np</span>
         , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">child_world</span>
         , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">global_world</span>
         ) : SliceUnion( sourceTensor
                       , {<span style="font-weight: bold; text-decoration: underline;">Slice</span>::A, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::B, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::C}
                       , {Nv, No, No} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the slices</span>
                       , {Nv}
                       , np
                       , child_world
                       , global_world
                       , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::TA
                       , 6) {
           init(sourceTensor);
         }

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">sliceIntoBuffer</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">it</span>, <span style="color: #c18401;">Tensor</span> &amp;<span style="color: #8b4513;">to</span>, <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">from</span>) <span style="color: #a626a4;">override</span>
    {
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">Nv</span> = sliceLength[0]
              , <span style="color: #8b4513;">No</span> = sliceLength[1]
              , <span style="color: #8b4513;">a</span> = rankMap.find({<span style="color: #a626a4;">static_cast</span>&lt;<span style="color: #c18401;">size_t</span>&gt;(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank), it});
              ;


      sliceIntoVector( sources[it]
                     , to,   {0, 0, 0},    {Nv, No, No}
                     , from, {a, 0, 0, 0}, {a+1, Nv, No, No}
                     );

    }

  };


  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">HHHA</span> : <span style="color: #a626a4;">public</span> <span style="color: #c18401;">SliceUnion</span> {
    <span style="color: #0184bc;">HHHA</span>( <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">sourceTensor</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np</span>
        , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">child_world</span>
        , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">global_world</span>
        ) : SliceUnion( sourceTensor
                      , {<span style="font-weight: bold; text-decoration: underline;">Slice</span>::A, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::B, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::C}
                      , {No, No, No} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the slices</span>
                      , {Nv}         <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the parametrization</span>
                      , np
                      , child_world
                      , global_world
                      , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::VIJKA
                      , 6) {
           init(sourceTensor);
         }

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">sliceIntoBuffer</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">it</span>, <span style="color: #c18401;">Tensor</span> &amp;<span style="color: #8b4513;">to</span>, <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">from</span>) <span style="color: #a626a4;">override</span>
    {

      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">No</span> = sliceLength[0]
              , <span style="color: #8b4513;">a</span> = rankMap.find({<span style="color: #a626a4;">static_cast</span>&lt;<span style="color: #c18401;">size_t</span>&gt;(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank), it})
              ;

      sliceIntoVector( sources[it]
                     , to,   {0, 0, 0},    {No, No, No}
                     , from, {0, 0, 0, a}, {No, No, No, a+1}
                     );

    }
  };

  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">ABPH</span> : <span style="color: #a626a4;">public</span> <span style="color: #c18401;">SliceUnion</span> {
    <span style="color: #0184bc;">ABPH</span>( <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">sourceTensor</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np</span>
        , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">child_world</span>
        , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">global_world</span>
        ) : SliceUnion( sourceTensor
                      , { <span style="font-weight: bold; text-decoration: underline;">Slice</span>::AB, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::BC, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::AC
                        , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::BA, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::CB, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::CA
                        }
                      , {Nv, No} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the slices</span>
                      , {Nv, Nv} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the parametrization</span>
                      , np
                      , child_world
                      , global_world
                      , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::VABCI
                      , 2*6) {
           init(sourceTensor);
         }

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">sliceIntoBuffer</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">it</span>, <span style="color: #c18401;">Tensor</span> &amp;<span style="color: #8b4513;">to</span>, <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">from</span>) <span style="color: #a626a4;">override</span> {

      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">Nv</span> = sliceLength[0]
              , <span style="color: #8b4513;">No</span> = sliceLength[1]
              , <span style="color: #8b4513;">el</span> = rankMap.find({<span style="color: #a626a4;">static_cast</span>&lt;<span style="color: #c18401;">size_t</span>&gt;(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank), it})
              , <span style="color: #8b4513;">a</span> = el % Nv
              , <span style="color: #8b4513;">b</span> = el / Nv
              ;


      sliceIntoVector( sources[it]
                     , to,   {0, 0},       {Nv, No}
                     , from, {a, b, 0, 0}, {a+1, b+1, Nv, No}
                     );

    }

  };

  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">ABHH</span> : <span style="color: #a626a4;">public</span> <span style="color: #c18401;">SliceUnion</span> {
    <span style="color: #0184bc;">ABHH</span>( <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">sourceTensor</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>
        , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np</span>
        , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">child_world</span>
        , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">global_world</span>
        ) : SliceUnion( sourceTensor
                      , {<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AB, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::BC, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::AC}
                      , {No, No} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the slices</span>
                      , {Nv, Nv} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the parametrization</span>
                      , np
                      , child_world
                      , global_world
                      , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::VABIJ
                      , 6) {
           init(sourceTensor);
         }

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">sliceIntoBuffer</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">it</span>, <span style="color: #c18401;">Tensor</span> &amp;<span style="color: #8b4513;">to</span>, <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">from</span>) <span style="color: #a626a4;">override</span> {

      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">Nv</span> = from.lens[0]
              , <span style="color: #8b4513;">No</span> = sliceLength[1]
              , <span style="color: #8b4513;">el</span> = rankMap.find({<span style="color: #a626a4;">static_cast</span>&lt;<span style="color: #c18401;">size_t</span>&gt;(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank), it})
              , <span style="color: #8b4513;">a</span> = el % Nv
              , <span style="color: #8b4513;">b</span> = el / Nv
              ;

      sliceIntoVector( sources[it]
                     , to,   {0, 0},       {No, No}
                     , from, {a, b, 0, 0}, {a+1, b+1, No, No}
                     );


    }

  };


  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">TABHH</span> : <span style="color: #a626a4;">public</span> <span style="color: #c18401;">SliceUnion</span> {
    <span style="color: #0184bc;">TABHH</span>( <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">sourceTensor</span>
         , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span>
         , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>
         , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">np</span>
         , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">child_world</span>
         , <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">global_world</span>
         ) : SliceUnion( sourceTensor
                       , {<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AB, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::BC, <span style="font-weight: bold; text-decoration: underline;">Slice</span>::AC}
                       , {No, No} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the slices</span>
                       , {Nv, Nv} <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">size of the parametrization</span>
                       , np
                       , child_world
                       , global_world
                       , <span style="font-weight: bold; text-decoration: underline;">Slice</span>::TABIJ
                       , 6) {
           init(sourceTensor);
         }

    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">sliceIntoBuffer</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">it</span>, <span style="color: #c18401;">Tensor</span> &amp;<span style="color: #8b4513;">to</span>, <span style="color: #c18401;">Tensor</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">from</span>) <span style="color: #a626a4;">override</span> {
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: maybe generalize this with ABHH</span>

      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">Nv</span> = from.lens[0]
              , <span style="color: #8b4513;">No</span> = sliceLength[1]
              , <span style="color: #8b4513;">el</span> = rankMap.find({<span style="color: #a626a4;">static_cast</span>&lt;<span style="color: #c18401;">size_t</span>&gt;(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank), it})
              , <span style="color: #8b4513;">a</span> = el % Nv
              , <span style="color: #8b4513;">b</span> = el / Nv
              ;

      sliceIntoVector( sources[it]
                     , to,   {0, 0},       {No, No}
                     , from, {a, b, 0, 0}, {a+1, b+1, No, No}
                     );


    }

  };

}
</pre>
</div>
</div>
</div>
