atrip.html


<div id="outline-container-org22c472e" class="outline-2">
<h2 id="org22c472e"><span class="section-number-2">8</span> Equations</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#pragma</span> once

<span style="color: #e44649;">#include</span><span style="color: #50a14f;">&lt;atrip/Slice.hpp&gt;</span>
<span style="color: #e44649;">#include</span><span style="color: #50a14f;">&lt;atrip/Blas.hpp&gt;</span>

<span style="color: #a626a4;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span> {

  <span style="color: #c18401;">double</span> <span style="color: #0184bc;">getEnergyDistinct</span>
    ( <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">epsabc</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">epsi</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">Tijk_</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">Zijk_</span>
    ) {
    <span style="color: #a626a4;">constexpr</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">blockSize</span>=16;
    <span style="color: #c18401;">double</span> <span style="color: #8b4513;">energy</span>(0.);
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span> = epsi.size();
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">kk</span>=0; kk&lt;No; kk+=blockSize){
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">kend</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::min(No, kk+blockSize) );
      <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">jj</span>(kk); jj&lt;No; jj+=blockSize){
        <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">jend</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::min( No, jj+blockSize) );
        <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">ii</span>(jj); ii&lt;No; ii+=blockSize){
          <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">iend</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::min( No, ii+blockSize) );
          <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">k</span>(kk); k &lt; kend; k++){
            <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">ek</span>(epsi[k]);
            <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">jstart</span> = jj &gt; k ? jj : k;
            <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span>(jstart); j &lt; jend; j++){
              <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">ej</span>(epsi[j]);
              <span style="color: #c18401;">double</span> <span style="color: #8b4513;">facjk</span>( j == k ? 0.5 : 1.0);
              <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">istart</span> = ii &gt; j ? ii : j;
              <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span>(istart); i &lt; iend; i++){
                <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">ei</span>(epsi[i]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">facij</span> ( i==j ? 0.5 : 1.0);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">denominator</span>(epsabc - ei - ej - ek);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">U</span>(Zijk_[i + No*j + No*No*k]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">V</span>(Zijk_[i + No*k + No*No*j]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">W</span>(Zijk_[j + No*i + No*No*k]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">X</span>(Zijk_[j + No*k + No*No*i]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">Y</span>(Zijk_[k + No*i + No*No*j]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">Z</span>(Zijk_[k + No*j + No*No*i]);

                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">A</span>(Tijk_[i + No*j + No*No*k]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">B</span>(Tijk_[i + No*k + No*No*j]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">C</span>(Tijk_[j + No*i + No*No*k]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">D</span>(Tijk_[j + No*k + No*No*i]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">E</span>(Tijk_[k + No*i + No*No*j]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">F</span>(Tijk_[k + No*j + No*No*i]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">value</span>(3.0*(<span style="color: #c18401;">A</span>*<span style="color: #8b4513;">U</span>+B*V+C*W+D*X+E*Y+F*Z)
                            +((U+X+Y)-2.0*(V+W+Z))*(A+D+E)
                            +((V+W+Z)-2.0*(U+X+Y))*(B+C+F));
                energy += 2.0*value / denominator * facjk * facij;
              } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">i</span>
            } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">j</span>
          } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">k</span>
        } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">ii</span>
      } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">jj</span>
    } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">kk</span>
    <span style="color: #a626a4;">return</span> energy;
  }


  <span style="color: #c18401;">double</span> <span style="color: #0184bc;">getEnergySame</span>
    ( <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">epsabc</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">epsi</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">Tijk_</span>
    , <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">Zijk_</span>
    ) {
    <span style="color: #a626a4;">constexpr</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">blockSize</span> = 16;
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span> = epsi.size();
    <span style="color: #c18401;">double</span> <span style="color: #8b4513;">energy</span>(0.);
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">kk</span>=0; kk&lt;No; kk+=blockSize){
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">kend</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::min( kk+blockSize, No) );
      <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">jj</span>(kk); jj&lt;No; jj+=blockSize){
        <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">jend</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::min( jj+blockSize, No) );
        <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">ii</span>(jj); ii&lt;No; ii+=blockSize){
          <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">iend</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::min( ii+blockSize, No) );
          <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">k</span>(kk); k &lt; kend; k++){
            <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">ek</span>(epsi[k]);
            <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">jstart</span> = jj &gt; k ? jj : k;
            <span style="color: #a626a4;">for</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span>(jstart); j &lt; jend; j++){
              <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">facjk</span>( j == k ? 0.5 : 1.0);
              <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">ej</span>(epsi[j]);
              <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">istart</span> = ii &gt; j ? ii : j;
              <span style="color: #a626a4;">for</span>(<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span>(istart); i &lt; iend; i++){
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">ei</span>(epsi[i]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">facij</span> ( i==j ? 0.5 : 1.0);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">denominator</span>(epsabc - ei - ej - ek);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">U</span>(Zijk_[i + No*j + No*No*k]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">V</span>(Zijk_[j + No*k + No*No*i]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">W</span>(Zijk_[k + No*i + No*No*j]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">A</span>(Tijk_[i + No*j + No*No*k]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">B</span>(Tijk_[j + No*k + No*No*i]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">C</span>(Tijk_[k + No*i + No*No*j]);
                <span style="color: #c18401;">double</span> <span style="color: #8b4513;">value</span>(3.0*( <span style="color: #c18401;">A</span>*<span style="color: #8b4513;">U</span> + B*V + C*W) - (A+B+C)*(U+V+W));
                energy += 2.0*value / denominator * facjk * facij;
              } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">i</span>
            } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">j</span>
          } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">k</span>
        } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">ii</span>
      } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">jj</span>
    } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">kk</span>
    <span style="color: #a626a4;">return</span> energy;
  }

  <span style="color: #c18401;">void</span> <span style="color: #0184bc;">singlesContribution</span>
    ( <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span>
    , <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span>
    , <span style="color: #a626a4;">const</span> <span style="color: #c18401;">ABCTuple</span> &amp;<span style="color: #8b4513;">abc</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">Tph</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VABij</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VACij</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VBCij</span>
    , <span style="color: #c18401;">double</span> *<span style="color: #8b4513;">Zijk</span>
    ) {
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">a</span>(abc[0]), <span style="color: #8b4513;">b</span>(abc[1]), <span style="color: #8b4513;">c</span>(abc[2]);
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">k</span>=0; k &lt; No; k++)
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span>=0; i &lt; No; i++)
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span>=0; j &lt; No; j++) {
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">ijk</span> = i + j*No + k*No*No
                ,  <span style="color: #8b4513;">jk</span> = j + No * k
                ;
      Zijk[ijk] += Tph[ a + i * Nv ] * VBCij[ j + k * No ];
      Zijk[ijk] += Tph[ b + j * Nv ] * VACij[ i + k * No ];
      Zijk[ijk] += Tph[ c + k * Nv ] * VABij[ i + j * No ];
    }
  }

  <span style="color: #c18401;">void</span> <span style="color: #0184bc;">doublesContribution</span>
    ( <span style="color: #a626a4;">const</span> <span style="color: #c18401;">ABCTuple</span> &amp;<span style="color: #8b4513;">abc</span>
    , <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">No</span>
    , <span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">Nv</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- VABCI</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VABph</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VACph</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VBCph</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VBAph</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VCAph</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VCBph</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- VHHHA</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VhhhA</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VhhhB</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">VhhhC</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- TA</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">TAphh</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">TBphh</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">TCphh</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- TABIJ</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">TABhh</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">TAChh</span>
    , <span style="color: #c18401;">double</span> <span style="color: #a626a4;">const</span>* <span style="color: #8b4513;">TBChh</span>
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- TIJK</span>
    , <span style="color: #c18401;">double</span> *<span style="color: #8b4513;">Tijk</span>
    ) {

    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">a</span> = abc[0], <span style="color: #8b4513;">b</span> = abc[1], <span style="color: #8b4513;">c</span> = abc[2]
              , <span style="color: #8b4513;">NoNo</span> = No*No, <span style="color: #8b4513;">NoNv</span> = No*Nv
              ;

<span style="color: #e44649;">#if</span> <span style="color: #e44649;">defined</span>(ATRIP_USE_DGEMM)
<span style="color: #e44649;">#define</span> <span style="color: #0184bc;">_IJK_</span>(<span style="color: #8b4513;">i</span>, <span style="color: #8b4513;">j</span>, <span style="color: #8b4513;">k</span>) i + j*No + k*NoNo
<span style="color: #e44649;">#define</span> <span style="color: #0184bc;">REORDER</span>(<span style="color: #8b4513;">__II</span>, <span style="color: #8b4513;">__JJ</span>, <span style="color: #8b4513;">__KK</span>)                           \
  WITH_CHRONO(<span style="color: #50a14f;">"double:reorder"</span>,                             \
              <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">k</span> = 0; k &lt; No; k++)               \
                <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span> = 0; j &lt; No; j++)             \
                  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 0; i &lt; No; i++) {         \
                    Tijk[_IJK_(i, j, k)]                    \
                    += _t_buffer[_IJK_(__II, __JJ, __KK)];  \
                  }                                         \
              )
<span style="color: #e44649;">#define</span> <span style="color: #0184bc;">DGEMM_PARTICLES</span>(<span style="color: #8b4513;">__A</span>, <span style="color: #8b4513;">__B</span>)               \
  <span style="font-weight: bold; text-decoration: underline;">atrip</span>::dgemm_(<span style="color: #50a14f;">"T"</span>,                            \
                <span style="color: #50a14f;">"N"</span>,                            \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;NoNo,              \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;No,                \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;Nv,                \
                &amp;one,                           \
                __A,                            \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;Nv,                \
                __B,                            \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;Nv,                \
                &amp;zero,                          \
                _t_buffer.data(),               \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;NoNo);
<span style="color: #e44649;">#define</span> <span style="color: #0184bc;">DGEMM_HOLES</span>(<span style="color: #8b4513;">__A</span>, <span style="color: #8b4513;">__B</span>, <span style="color: #8b4513;">__TRANSB</span>)         \
  <span style="font-weight: bold; text-decoration: underline;">atrip</span>::dgemm_(<span style="color: #50a14f;">"N"</span>,                            \
                __TRANSB,                       \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;NoNo,              \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;No,                \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;No,                \
                &amp;m_one,                         \
                __A,                            \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;NoNo,              \
                __B,                            \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;No,                \
                &amp;zero,                          \
                _t_buffer.data(),               \
                (<span style="color: #c18401;">int</span> <span style="color: #a626a4;">const</span>*)&amp;NoNo);

    <span style="color: #a626a4;">using</span> <span style="color: #c18401;">F</span> = <span style="color: #c18401;">double</span>;
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">NoNoNo</span> = No*NoNo;
    <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #8b4513;">_t_buffer</span>;
    _t_buffer.reserve(NoNoNo);
    <span style="color: #c18401;">F</span> <span style="color: #8b4513;">one</span>{1.0}, <span style="color: #8b4513;">m_one</span>{-1.0}, <span style="color: #8b4513;">zero</span>{0.0};

    WITH_CHRONO(<span style="color: #50a14f;">"double:reorder"</span>,
      <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">k</span> = 0; k &lt; NoNoNo; k++) {
         Tijk[k] = 0.0;
       })

    WITH_CHRONO(<span style="color: #50a14f;">"doubles:holes"</span>,
                { <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Holes part ================================================</span>
                  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">VhhhC[i + k*No + L*NoNo] * TABhh[L + j*No]; H1</span>
                  WITH_CHRONO(<span style="color: #50a14f;">"doubles:holes:1"</span>,
                              DGEMM_HOLES(VhhhC, TABhh, <span style="color: #50a14f;">"N"</span>)
                              REORDER(i, k, j)
                              )
                  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">VhhhC[j + k*No + L*NoNo] * TABhh[i + L*No]; H0</span>
                  WITH_CHRONO(<span style="color: #50a14f;">"doubles:holes:2"</span>,
                              DGEMM_HOLES(VhhhC, TABhh, <span style="color: #50a14f;">"T"</span>)
                              REORDER(j, k, i)
                              )
                  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">VhhhB[i + j*No + L*NoNo] * TAChh[L + k*No]; H5</span>
                  WITH_CHRONO(<span style="color: #50a14f;">"doubles:holes:3"</span>,
                              DGEMM_HOLES(VhhhB, TAChh, <span style="color: #50a14f;">"N"</span>)
                              REORDER(i, j, k)
                              )
                  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">VhhhB[k + j*No + L*NoNo] * TAChh[i + L*No]; H3</span>
                  WITH_CHRONO(<span style="color: #50a14f;">"doubles:holes:4"</span>,
                              DGEMM_HOLES(VhhhB, TAChh, <span style="color: #50a14f;">"T"</span>)
                              REORDER(k, j, i)
                              )
                  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">VhhhA[j + i*No + L*NoNo] * TBChh[L + k*No]; H1</span>
                  WITH_CHRONO(<span style="color: #50a14f;">"doubles:holes:5"</span>,
                              DGEMM_HOLES(VhhhA, TBChh, <span style="color: #50a14f;">"N"</span>)
                              REORDER(j, i, k)
                              )
                  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">VhhhA[k + i*No + L*NoNo] * TBChh[j + L*No]; H4</span>
                  WITH_CHRONO(<span style="color: #50a14f;">"doubles:holes:6"</span>,
                              DGEMM_HOLES(VhhhA, TBChh, <span style="color: #50a14f;">"T"</span>)
                              REORDER(k, i, j)
                              )
                }
                )

      WITH_CHRONO(<span style="color: #50a14f;">"doubles:particles"</span>,
                  { <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Particle part ===========================================</span>
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TAphh[E + i*Nv + j*NoNv] * VBCph[E + k*Nv]; P0</span>
                    WITH_CHRONO(<span style="color: #50a14f;">"doubles:particles:1"</span>,
                                DGEMM_PARTICLES(TAphh, VBCph)
                                REORDER(i, j, k)
                                )
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TAphh[E + i*Nv + k*NoNv] * VCBph[E + j*Nv]; P3</span>
                    WITH_CHRONO(<span style="color: #50a14f;">"doubles:particles:2"</span>,
                                DGEMM_PARTICLES(TAphh, VCBph)
                                REORDER(i, k, j)
                                )
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TCphh[E + k*Nv + i*NoNv] * VABph[E + j*Nv]; P5</span>
                    WITH_CHRONO(<span style="color: #50a14f;">"doubles:particles:3"</span>,
                                DGEMM_PARTICLES(TCphh, VABph)
                                REORDER(k, i, j)
                                )
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TCphh[E + k*Nv + j*NoNv] * VBAph[E + i*Nv]; P2</span>
                    WITH_CHRONO(<span style="color: #50a14f;">"doubles:particles:4"</span>,
                                DGEMM_PARTICLES(TCphh, VBAph)
                                REORDER(k, j, i)
                                )
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TBphh[E + j*Nv + i*NoNv] * VACph[E + k*Nv]; P1</span>
                    WITH_CHRONO(<span style="color: #50a14f;">"doubles:particles:5"</span>,
                                DGEMM_PARTICLES(TBphh, VACph)
                                REORDER(j, i, k)
                                )
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TBphh[E + j*Nv + k*NoNv] * VCAph[E + i*Nv]; P4</span>
                    WITH_CHRONO(<span style="color: #50a14f;">"doubles:particles:6"</span>,
                                DGEMM_PARTICLES(TBphh, VCAph)
                                REORDER(j, k, i)
                                )
                  }
                  )

<span style="color: #e44649;">#undef</span> REORDER
<span style="color: #e44649;">#undef</span> DGEMM_HOLES
<span style="color: #e44649;">#undef</span> DGEMM_PARTICLES
<span style="color: #e44649;">#undef</span> _IJK_
<span style="color: #e44649;">#else</span>
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">k</span> = 0; k &lt; No; k++)
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">j</span> = 0; j &lt; No; j++)
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 0; i &lt; No; i++){
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">ijk</span> = i + j*No + k*NoNo
                ,  <span style="color: #8b4513;">jk</span> = j + k*No
                ;
      Tijk[ijk] = 0.0; <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">:important</span>
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">HOLE DIAGRAMS: TABHH and VHHHA</span>
      <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">L</span> = 0; L &lt; No; L++){
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[abLj] * V[Lcik]        H1</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[baLi] * V[Lcjk]        H0      TODO: conjugate T for complex</span>
        Tijk[ijk] -= TABhh[L + j*No] * VhhhC[i + k*No + L*NoNo];
        Tijk[ijk] -= TABhh[i + L*No] * VhhhC[j + k*No + L*NoNo];

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[acLk] * V[Lbij]        H5</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[caLi] * V[Lbkj]        H3</span>
        Tijk[ijk] -= TAChh[L + k*No] * VhhhB[i + j*No + L*NoNo];
        Tijk[ijk] -= TAChh[i + L*No] * VhhhB[k + j*No + L*NoNo];

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[bcLk] * V[Laji]        H2</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[cbLj] * V[Laki]        H4</span>
        Tijk[ijk] -= TBChh[L + k*No] * VhhhA[j + i*No + L*NoNo];
        Tijk[ijk] -= TBChh[j + L*No] * VhhhA[k + i*No + L*NoNo];
      }
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">PARTILCE DIAGRAMS: TAPHH and VABPH</span>
      <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">E</span> = 0; E &lt; Nv; E++) {
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[aEij] * V[bcEk]        P0</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[aEik] * V[cbEj]        P3 // TODO: CHECK THIS ONE, I DONT KNOW</span>
        Tijk[ijk] += TAphh[E + i*Nv + j*NoNv] * VBCph[E + k*Nv];
        Tijk[ijk] += TAphh[E + i*Nv + k*NoNv] * VCBph[E + j*Nv];

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[cEki] * V[abEj]        P5</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[cEkj] * V[baEi]        P2</span>
        Tijk[ijk] += TCphh[E + k*Nv + i*NoNv] * VABph[E + j*Nv];
        Tijk[ijk] += TCphh[E + k*Nv + j*NoNv] * VBAph[E + i*Nv];

        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[bEji] * V[acEk]        P1</span>
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">t[bEjk] * V[caEi]        P4</span>
        Tijk[ijk] += TBphh[E + j*Nv + i*NoNv] * VACph[E + k*Nv];
        Tijk[ijk] += TBphh[E + j*Nv + k*NoNv] * VCAph[E + i*Nv];
      }

    }
<span style="color: #e44649;">#endif</span>
  }

}
</pre>
</div>
</div>
</div>
