atrip.html

<div id="outline-container-orgb82b3e5" class="outline-2">
<h2 id="orgb82b3e5"><span class="section-number-2">9</span> Blas</h2>
<div class="outline-text-2" id="text-9">
<p>
The main matrix-matrix multiplication method used in this algorithm
is mainly using the <code>DGEMM</code> function, which we declare as
<code>extern</code> since it should be known only at link-time.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#pragma</span> once
<span style="color: #a626a4;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span> {
  <span style="color: #a626a4;">extern</span> <span style="color: #50a14f;">"C"</span> {
    <span style="color: #c18401;">void</span> <span style="color: #0184bc;">dgemm_</span>(
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">char</span> *<span style="color: #8b4513;">transa</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">char</span> *<span style="color: #8b4513;">transb</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> *<span style="color: #8b4513;">m</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> *<span style="color: #8b4513;">n</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> *<span style="color: #8b4513;">k</span>,
      <span style="color: #c18401;">double</span> *<span style="color: #8b4513;">alpha</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> *<span style="color: #8b4513;">A</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> *<span style="color: #8b4513;">lda</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> *<span style="color: #8b4513;">B</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> *<span style="color: #8b4513;">ldb</span>,
      <span style="color: #c18401;">double</span> *<span style="color: #8b4513;">beta</span>,
      <span style="color: #c18401;">double</span> *<span style="color: #8b4513;">C</span>,
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> *<span style="color: #8b4513;">ldc</span>
    );
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb92f75" class="outline-2">
<h2 id="orgfb92f75"><span class="section-number-2">10</span> Atrip</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org49512bb" class="outline-3">
<h3 id="org49512bb"><span class="section-number-3">10.1</span> Header</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#pragma</span> once
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;sstream&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;string&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;map&gt;</span>

<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;ctf.hpp&gt;</span>

<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Utils.hpp&gt;</span>

<span style="color: #e44649;">#define</span> <span style="color: #0184bc;">ADD_ATTRIBUTE</span>(<span style="color: #8b4513;">_type</span>, <span style="color: #8b4513;">_name</span>, <span style="color: #8b4513;">_default</span>)   \
  <span style="color: #c18401;">_type</span> <span style="color: #8b4513;">_name</span> = _default;                       \
  <span style="color: #c18401;">Input</span>&amp; <span style="color: #8b4513;">with_</span> ## _name(<span style="color: #c18401;">_type</span> <span style="color: #8b4513;">i</span>) {              \
    _name = i;                                  \
    <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>;                               \
  }

<span style="color: #a626a4;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span> {

  <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Atrip</span> {

    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">rank</span>;
    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">np</span>;
    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">Timings</span> <span style="color: #8b4513;">chrono</span>;
    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">networkSend</span>;
    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">localSend</span>;
    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">void</span> <span style="color: #0184bc;">init</span>();

    <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Input</span> {
      <span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; *<span style="color: #8b4513;">ei</span> = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                        , *<span style="color: #8b4513;">ea</span> = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                        , *<span style="color: #8b4513;">Tph</span> = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                        , *<span style="color: #8b4513;">Tpphh</span> = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                        , *<span style="color: #8b4513;">Vpphh</span> = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                        , *<span style="color: #8b4513;">Vhhhp</span> = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                        , *<span style="color: #8b4513;">Vppph</span> = <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                        ;
      <span style="color: #c18401;">Input</span>&amp; <span style="color: #0184bc;">with_epsilon_i</span>(<span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; * <span style="color: #8b4513;">t</span>) { ei = t; <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>; }
      <span style="color: #c18401;">Input</span>&amp; <span style="color: #0184bc;">with_epsilon_a</span>(<span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; * <span style="color: #8b4513;">t</span>) { ea = t; <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>; }
      <span style="color: #c18401;">Input</span>&amp; <span style="color: #0184bc;">with_Tai</span>(<span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; * <span style="color: #8b4513;">t</span>) { Tph = t; <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>; }
      <span style="color: #c18401;">Input</span>&amp; <span style="color: #0184bc;">with_Tabij</span>(<span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; * <span style="color: #8b4513;">t</span>) { Tpphh = t; <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>; }
      <span style="color: #c18401;">Input</span>&amp; <span style="color: #0184bc;">with_Vabij</span>(<span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; * <span style="color: #8b4513;">t</span>) { Vpphh = t; <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>; }
      <span style="color: #c18401;">Input</span>&amp; <span style="color: #0184bc;">with_Vijka</span>(<span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; * <span style="color: #8b4513;">t</span>) { Vhhhp = t; <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>; }
      <span style="color: #c18401;">Input</span>&amp; <span style="color: #0184bc;">with_Vabci</span>(<span style="font-weight: bold; text-decoration: underline;">CTF</span>::<span style="color: #c18401;">Tensor</span>&lt;<span style="color: #c18401;">double</span>&gt; * <span style="color: #8b4513;">t</span>) { Vppph = t; <span style="color: #a626a4;">return</span> *<span style="color: #a626a4;">this</span>; }

      <span style="color: #a626a4;">enum</span> <span style="color: #c18401;">TuplesDistribution</span> {
        <span style="color: #8b4513;">NAIVE</span>,
        <span style="color: #8b4513;">GROUP_AND_SORT</span>,
      };

      ADD_ATTRIBUTE(<span style="color: #c18401;">bool</span>, rankRoundRobin, <span style="font-weight: bold; text-decoration: underline;">false</span>)
      ADD_ATTRIBUTE(<span style="color: #c18401;">bool</span>, chrono, <span style="font-weight: bold; text-decoration: underline;">false</span>)
      ADD_ATTRIBUTE(<span style="color: #c18401;">bool</span>, barrier, <span style="font-weight: bold; text-decoration: underline;">false</span>)
      ADD_ATTRIBUTE(<span style="color: #c18401;">int</span>, maxIterations, 0)
      ADD_ATTRIBUTE(<span style="color: #c18401;">int</span>, iterationMod, -1)
      ADD_ATTRIBUTE(<span style="color: #c18401;">int</span>, percentageMod, -1)
      ADD_ATTRIBUTE(<span style="color: #c18401;">TuplesDistribution</span>, tuplesDistribution, NAIVE)


    };

    <span style="color: #a626a4;">struct</span> <span style="color: #c18401;">Output</span> {
      <span style="color: #c18401;">double</span> <span style="color: #8b4513;">energy</span>;
    };
    <span style="color: #a626a4;">static</span> <span style="color: #c18401;">Output</span> <span style="color: #0184bc;">run</span>(<span style="color: #c18401;">Input</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">in</span>);
  };

}

<span style="color: #e44649;">#undef</span> ADD_ATTRIBUTE
</pre>
</div>
</div>
</div>
