atrip.html

<div id="outline-container-orgae5a8f5" class="outline-3">
<h3 id="orgae5a8f5"><span class="section-number-3">10.2</span> Main</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;iomanip&gt;</span>

<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Atrip.hpp&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Utils.hpp&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Equations.hpp&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/SliceUnion.hpp&gt;</span>
<span style="color: #e44649;">#include</span> <span style="color: #50a14f;">&lt;atrip/Unions.hpp&gt;</span>

<span style="color: #a626a4;">using</span> <span style="color: #a626a4;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span>;

<span style="color: #c18401;">bool</span> <span style="font-weight: bold; text-decoration: underline;">RankMap</span>::<span style="color: #8b4513;">RANK_ROUND_ROBIN</span>;
<span style="color: #c18401;">int</span> <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #8b4513;">rank</span>;
<span style="color: #c18401;">int</span> <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #8b4513;">np</span>;
<span style="color: #c18401;">Timings</span> <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #8b4513;">chrono</span>;
<span style="color: #c18401;">size_t</span> <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #8b4513;">networkSend</span>;
<span style="color: #c18401;">size_t</span> <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #8b4513;">localSend</span>;

<span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">user printing block</span>
<span style="color: #c18401;">IterationDescriptor</span> <span style="font-weight: bold; text-decoration: underline;">IterationDescription</span>::<span style="color: #8b4513;">descriptor</span>;
<span style="color: #c18401;">void</span> <span style="font-weight: bold; text-decoration: underline;">atrip</span>::<span style="color: #0184bc;">registerIterationDescriptor</span>(<span style="color: #c18401;">IterationDescriptor</span> <span style="color: #8b4513;">d</span>) {
  <span style="font-weight: bold; text-decoration: underline;">IterationDescription</span>::descriptor = d;
}

<span style="color: #c18401;">void</span> <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #0184bc;">init</span>()  {
  MPI_Comm_rank(MPI_COMM_WORLD, &amp;<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank);
  MPI_Comm_size(MPI_COMM_WORLD, &amp;<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::np);
  <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::networkSend = 0;
  <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::localSend = 0;
}

<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #c18401;">Output</span> <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #0184bc;">run</span>(<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="color: #c18401;">Input</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">in</span>) {

  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">np</span> = <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::np;
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">int</span> <span style="color: #8b4513;">rank</span> = <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::rank;
  <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">universe</span> = in.ei-&gt;wrld-&gt;comm;

  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">No</span> = in.ei-&gt;lens[0];
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">Nv</span> = in.ea-&gt;lens[0];
  LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"No: "</span> &lt;&lt; No &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"Nv: "</span> &lt;&lt; Nv &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"np: "</span> &lt;&lt; np &lt;&lt; <span style="color: #50a14f;">"\n"</span>;

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">allocate the three scratches, see piecuch</span>
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt;<span style="color: #c18401;">double</span>&gt; <span style="color: #8b4513;">Tijk</span>(No*No*No) <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">doubles only (see piecuch)</span>
                    , <span style="color: #8b4513;">Zijk</span>(No*No*No) <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">singles + doubles (see piecuch)</span>
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">we need local copies of the following tensors on every</span>
                    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">rank</span>
                    , <span style="color: #8b4513;">epsi</span>(No)
                    , <span style="color: #8b4513;">epsa</span>(Nv)
                    , <span style="color: #8b4513;">Tai</span>(No * Nv)
                    ;

  in.ei-&gt;read_all(epsi.data());
  in.ea-&gt;read_all(epsa.data());
  in.Tph-&gt;read_all(Tai.data());

  <span style="font-weight: bold; text-decoration: underline;">RankMap</span>::RANK_ROUND_ROBIN = in.rankRoundRobin;
  <span style="color: #a626a4;">if</span> (<span style="font-weight: bold; text-decoration: underline;">RankMap</span>::RANK_ROUND_ROBIN) {
    LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"Doing rank round robin slices distribution"</span> &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  } <span style="color: #a626a4;">else</span> {
    LOG(0,<span style="color: #50a14f;">"Atrip"</span>)
      &lt;&lt; <span style="color: #50a14f;">"Doing node &gt; local rank round robin slices distribution"</span> &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  }


  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">COMMUNICATOR CONSTRUCTION ========================================={{{1</span>
  <span style="color: #a0a1a7; font-weight: bold;">//</span>
  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">Construct a new communicator living only on a single rank</span>
  <span style="color: #c18401;">int</span> <span style="color: #8b4513;">child_size</span> = 1
    , <span style="color: #8b4513;">child_rank</span>
    ;
  <span style="color: #a626a4;">const</span>
  <span style="color: #c18401;">int</span> <span style="color: #8b4513;">color</span> = rank / child_size
    , <span style="color: #8b4513;">crank</span> = rank % child_size
    ;
  <span style="color: #c18401;">MPI_Comm</span> <span style="color: #8b4513;">child_comm</span>;
  <span style="color: #a626a4;">if</span> (np == 1) {
    child_comm = universe;
  } <span style="color: #a626a4;">else</span> {
    MPI_Comm_split(universe, color, crank, &amp;child_comm);
    MPI_Comm_rank(child_comm, &amp;child_rank);
    MPI_Comm_size(child_comm, &amp;child_size);
  }


  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">BUILD SLICES PARAMETRIZED BY NV ==================================={{{1</span>
  WITH_CHRONO(<span style="color: #50a14f;">"nv-slices"</span>,
    LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"BUILD NV-SLICES\n"</span>;
    <span style="color: #c18401;">TAPHH</span> <span style="color: #8b4513;">taphh</span>(*in.Tpphh, (<span style="color: #c18401;">size_t</span>)No, (<span style="color: #c18401;">size_t</span>)Nv, (<span style="color: #c18401;">size_t</span>)np, child_comm, universe);
    <span style="color: #c18401;">HHHA</span>  <span style="color: #8b4513;">hhha</span>(*in.Vhhhp, (<span style="color: #c18401;">size_t</span>)No, (<span style="color: #c18401;">size_t</span>)Nv, (<span style="color: #c18401;">size_t</span>)np, child_comm, universe);
  )

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">BUILD SLICES PARAMETRIZED BY NV x NV =============================={{{1</span>
  WITH_CHRONO(<span style="color: #50a14f;">"nv-nv-slices"</span>,
    LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"BUILD NV x NV-SLICES\n"</span>;
    <span style="color: #c18401;">ABPH</span> <span style="color: #8b4513;">abph</span>(*in.Vppph, (<span style="color: #c18401;">size_t</span>)No, (<span style="color: #c18401;">size_t</span>)Nv, (<span style="color: #c18401;">size_t</span>)np, child_comm, universe);
    <span style="color: #c18401;">ABHH</span> <span style="color: #8b4513;">abhh</span>(*in.Vpphh, (<span style="color: #c18401;">size_t</span>)No, (<span style="color: #c18401;">size_t</span>)Nv, (<span style="color: #c18401;">size_t</span>)np, child_comm, universe);
    <span style="color: #c18401;">TABHH</span> <span style="color: #8b4513;">tabhh</span>(*in.Tpphh, (<span style="color: #c18401;">size_t</span>)No, (<span style="color: #c18401;">size_t</span>)Nv, (<span style="color: #c18401;">size_t</span>)np, child_comm, universe);
  )

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">all tensors</span>
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">vector</span>&lt; <span style="color: #c18401;">SliceUnion</span>* &gt; <span style="color: #8b4513;">unions</span> = {&amp;taphh, &amp;hhha, &amp;abph, &amp;abhh, &amp;tabhh};

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">get tuples for the current rank</span>
  <span style="color: #c18401;">TuplesDistribution</span> *<span style="color: #8b4513;">distribution</span>;

  <span style="color: #a626a4;">if</span> (in.tuplesDistribution == <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::<span style="font-weight: bold; text-decoration: underline;">Input</span>::<span style="font-weight: bold; text-decoration: underline;">TuplesDistribution</span>::NAIVE) {
    LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"Using the naive distribution\n"</span>;
    distribution = <span style="color: #a626a4;">new</span> <span style="color: #c18401;">NaiveDistribution</span>();
  } <span style="color: #a626a4;">else</span> {
    LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"Using the group-and-sort distribution\n"</span>;
    distribution = <span style="color: #a626a4;">new</span> <span style="font-weight: bold; text-decoration: underline;">group_and_sort</span>::<span style="color: #c18401;">Distribution</span>();
  }

  LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"BUILDING TUPLE LIST\n"</span>;
  WITH_CHRONO(<span style="color: #50a14f;">"tuples:build"</span>,
    <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">tuplesList</span> = distribution-&gt;getTuples(Nv, universe);
    )
  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">nIterations</span> = tuplesList.size();
  {
    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">_all_tuples</span> = Nv * (Nv + 1) * (Nv + 2) / 6 - Nv;
    LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"#iterations: "</span>
                  &lt;&lt; nIterations
                  &lt;&lt; <span style="color: #50a14f;">"/"</span>
                  &lt;&lt; nIterations * np
                  &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  }

  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span>
      <span style="color: #8b4513;">iterationMod</span> = (in.percentageMod &gt; 0)
                  ? nIterations * in.percentageMod / 100
                  : in.iterationMod

    , <span style="color: #8b4513;">iteration1Percent</span> = nIterations * 0.01
    ;



  <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span> <span style="color: #c18401;">isFakeTuple</span>
    = [&amp;<span style="color: #8b4513;">tuplesList</span>, <span style="font-weight: bold; text-decoration: underline;">distribution</span>](<span style="color: #c18401;">size_t</span> <span style="color: #a626a4;">const</span> <span style="color: #8b4513;">i</span>) {
      <span style="color: #a626a4;">return</span> distribution-&gt;tupleIsFake(tuplesList[i]);
    };


  <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">communicateDatabase</span>
    = [ &amp;<span style="color: #8b4513;">unions</span>
      , <span style="font-weight: bold; text-decoration: underline;">np</span>
      ] (<span style="color: #c18401;">ABCTuple</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">abc</span>, <span style="color: #c18401;">MPI_Comm</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">c</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Database {

        WITH_CHRONO(<span style="color: #50a14f;">"db:comm:type:do"</span>,
          <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">MPI_LDB_ELEMENT</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="font-weight: bold; text-decoration: underline;">mpi</span>::localDatabaseElement();
        )

        WITH_CHRONO(<span style="color: #50a14f;">"db:comm:ldb"</span>,
          <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">LocalDatabase</span> <span style="color: #8b4513;">ldb</span>;
          <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">tensor</span>: unions) {
            <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">tensorDb</span> = tensor-&gt;buildLocalDatabase(abc);
            ldb.insert(ldb.end(), tensorDb.begin(), tensorDb.end());
          }
        )

        <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Database</span> <span style="color: #8b4513;">db</span>(np * ldb.size(), ldb[0]);

        WITH_CHRONO(<span style="color: #50a14f;">"oneshot-db:comm:allgather"</span>,
        WITH_CHRONO(<span style="color: #50a14f;">"db:comm:allgather"</span>,
          MPI_Allgather( ldb.data()
                      , ldb.size()
                      , MPI_LDB_ELEMENT
                      , db.data()
                      , ldb.size()
                      , MPI_LDB_ELEMENT
                      , c);
        ))

        WITH_CHRONO(<span style="color: #50a14f;">"db:comm:type:free"</span>,
          MPI_Type_free(&amp;MPI_LDB_ELEMENT);
        )

        <span style="color: #a626a4;">return</span> db;
      };

  <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">doIOPhase</span>
    = [&amp;<span style="color: #8b4513;">unions</span>, &amp;<span style="color: #8b4513;">rank</span>, &amp;<span style="color: #8b4513;">np</span>, &amp;<span style="color: #8b4513;">universe</span>] (<span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">Database</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">db</span>) {

    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">localDBLength</span> = db.size() / np;

    <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">sendTag</span> = 0
         , <span style="color: #8b4513;">recvTag</span> = rank * localDBLength
         ;

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">RECIEVE PHASE ======================================================</span>
    {
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">At this point, we have already send to everyone that fits</span>
      <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">begin</span> = &amp;db[rank * localDBLength]
                , <span style="color: #8b4513;">end</span>   = begin + localDBLength
                ;
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">it</span> = begin; it != end; ++it) {
        recvTag++;
        <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">el</span> = *it;
        <span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">u</span> = unionByName(unions, el.name);

        <span style="color: #c18401;">WITH_DBG</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #8b4513;">cout</span>
          &lt;&lt; rank &lt;&lt; <span style="color: #50a14f;">":r"</span>
          &lt;&lt; <span style="color: #50a14f;">"&#9839;"</span> &lt;&lt; recvTag &lt;&lt; <span style="color: #50a14f;">" =&gt;"</span>
          &lt;&lt; <span style="color: #50a14f;">" &#171;n"</span> &lt;&lt; el.name
          &lt;&lt; <span style="color: #50a14f;">", t"</span> &lt;&lt; el.info.type
          &lt;&lt; <span style="color: #50a14f;">", s"</span> &lt;&lt; el.info.state
          &lt;&lt; <span style="color: #50a14f;">"&#187;"</span>
          &lt;&lt; <span style="color: #50a14f;">" &#8857; {"</span> &lt;&lt; rank &lt;&lt; <span style="color: #50a14f;">"&#8656;"</span> &lt;&lt; el.info.from.rank
                    &lt;&lt; <span style="color: #50a14f;">", "</span>
                    &lt;&lt; el.info.from.source &lt;&lt; <span style="color: #50a14f;">"}"</span>
          &lt;&lt; <span style="color: #50a14f;">" &#8756; {"</span> &lt;&lt; el.info.tuple[0]
                    &lt;&lt; <span style="color: #50a14f;">", "</span>
                    &lt;&lt; el.info.tuple[1]
                    &lt;&lt; <span style="color: #50a14f;">"}"</span>
          &lt;&lt; <span style="color: #50a14f;">"\n"</span>
          ;

        WITH_CHRONO(<span style="color: #50a14f;">"db:io:recv"</span>,
          u.receive(el.info, recvTag);
        )

      } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">recv</span>
    }

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">SEND PHASE =========================================================</span>
    <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">otherRank</span> = 0; otherRank&lt;np; otherRank++) {
      <span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">begin</span> = &amp;db[otherRank * localDBLength]
                , <span style="color: #8b4513;">end</span> = begin + localDBLength
                ;
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">it</span> = begin; it != end; ++it) {
        sendTag++;
        <span style="font-weight: bold; text-decoration: underline;">Slice</span>::<span style="color: #c18401;">LocalDatabaseElement</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">el</span> = *it;

        <span style="color: #a626a4;">if</span> (el.info.from.rank != rank) <span style="color: #a626a4;">continue</span>;

        <span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">u</span> = unionByName(unions, el.name);
        <span style="color: #c18401;">WITH_DBG</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #8b4513;">cout</span>
          &lt;&lt; rank &lt;&lt; <span style="color: #50a14f;">":s"</span>
          &lt;&lt; <span style="color: #50a14f;">"&#9839;"</span> &lt;&lt; sendTag &lt;&lt; <span style="color: #50a14f;">" =&gt;"</span>
          &lt;&lt; <span style="color: #50a14f;">" &#171;n"</span> &lt;&lt; el.name
          &lt;&lt; <span style="color: #50a14f;">", t"</span> &lt;&lt; el.info.type
          &lt;&lt; <span style="color: #50a14f;">", s"</span> &lt;&lt; el.info.state
          &lt;&lt; <span style="color: #50a14f;">"&#187;"</span>
          &lt;&lt; <span style="color: #50a14f;">" &#8857; {"</span> &lt;&lt; el.info.from.rank &lt;&lt; <span style="color: #50a14f;">"&#8658;"</span> &lt;&lt; otherRank
                    &lt;&lt; <span style="color: #50a14f;">", "</span>
                    &lt;&lt; el.info.from.source &lt;&lt; <span style="color: #50a14f;">"}"</span>
          &lt;&lt; <span style="color: #50a14f;">" &#8756; {"</span> &lt;&lt; el.info.tuple[0]
                    &lt;&lt; <span style="color: #50a14f;">", "</span>
                    &lt;&lt; el.info.tuple[1]
                    &lt;&lt; <span style="color: #50a14f;">"}"</span>
          &lt;&lt; <span style="color: #50a14f;">"\n"</span>
          ;

        WITH_CHRONO(<span style="color: #50a14f;">"db:io:send"</span>,
          u.send(otherRank, el, sendTag);
        )

      } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">send phase</span>

    } <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">otherRank</span>


  };

<span style="color: #e44649;">#if</span> <span style="color: #e44649;">defined</span>(HAVE_OCD) || <span style="color: #e44649;">defined</span>(ATRIP_PRINT_TUPLES)
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="color: #c18401;">map</span>&lt;<span style="color: #c18401;">ABCTuple</span>, <span style="color: #c18401;">double</span>&gt; <span style="color: #8b4513;">tupleEnergies</span>;
<span style="color: #e44649;">#endif</span>

  <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">doublesFlops</span>
    = <span style="color: #c18401;">double</span>(No)
    * <span style="color: #c18401;">double</span>(No)
    * <span style="color: #c18401;">double</span>(No)
    * (<span style="color: #c18401;">double</span>(<span style="color: #8b4513;">No</span>) + <span style="color: #c18401;">double</span>(Nv))
    * 2
    * 6
    / 1e9
    ;

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">START MAIN LOOP ======================================================{{{1</span>

  <span style="color: #c18401;">double</span> <span style="color: #8b4513;">energy</span>(0.);

  <span style="color: #a626a4;">for</span> ( <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 0, <span style="color: #8b4513;">iteration</span> = 1
      ; i &lt; tuplesList.size()
      ; i++, iteration++
      ) {
    <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[<span style="color: #50a14f;">"iterations"</span>].start();

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">check overhead from chrono over all iterations</span>
    WITH_CHRONO(<span style="color: #50a14f;">"start:stop"</span>, {})

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">check overhead of doing a barrier at the beginning</span>
    WITH_CHRONO(<span style="color: #50a14f;">"oneshot-mpi:barrier"</span>,
    WITH_CHRONO(<span style="color: #50a14f;">"mpi:barrier"</span>,
      <span style="color: #a626a4;">if</span> (in.barrier) MPI_Barrier(universe);
    ))

    <span style="color: #a626a4;">if</span> (iteration % iterationMod == 0 || iteration == iteration1Percent) {

      <span style="color: #a626a4;">if</span> (<span style="font-weight: bold; text-decoration: underline;">IterationDescription</span>::descriptor) {
        <span style="font-weight: bold; text-decoration: underline;">IterationDescription</span>::descriptor({
          iteration,
          nIterations,
          <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[<span style="color: #50a14f;">"iterations"</span>].count()
        });
      }

      <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">networkSend</span>;
      MPI_Reduce(&amp;<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::networkSend,
                 &amp;networkSend,
                 1,
                 MPI_UINT64_T,
                 MPI_SUM,
                 0,
                 universe);

      <span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">localSend</span>;
      MPI_Reduce(&amp;<span style="font-weight: bold; text-decoration: underline;">Atrip</span>::localSend,
                 &amp;localSend,
                 1,
                 MPI_UINT64_T,
                 MPI_SUM,
                 0,
                 universe);

      LOG(0,<span style="color: #50a14f;">"Atrip"</span>)
        &lt;&lt; <span style="color: #50a14f;">"iteration "</span> &lt;&lt; iteration
        &lt;&lt; <span style="color: #50a14f;">" ["</span> &lt;&lt; 100 * iteration / nIterations &lt;&lt; <span style="color: #50a14f;">"%]"</span>
        &lt;&lt; <span style="color: #50a14f;">" ("</span> &lt;&lt; doublesFlops * iteration / <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[<span style="color: #50a14f;">"doubles"</span>].count()
        &lt;&lt; <span style="color: #50a14f;">"GF)"</span>
        &lt;&lt; <span style="color: #50a14f;">" ("</span> &lt;&lt; doublesFlops * iteration / <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[<span style="color: #50a14f;">"iterations"</span>].count()
        &lt;&lt; <span style="color: #50a14f;">"GF)"</span>
        &lt;&lt; <span style="color: #50a14f;">" :net "</span> &lt;&lt; networkSend
        &lt;&lt; <span style="color: #50a14f;">" :loc "</span> &lt;&lt; localSend
        &lt;&lt; <span style="color: #50a14f;">" :loc/net "</span> &lt;&lt; (<span style="color: #c18401;">double</span>(<span style="color: #8b4513;">localSend</span>) / <span style="color: #c18401;">double</span>(networkSend))
        <span style="color: #a0a1a7; font-weight: bold;">//</span><span style="color: #a0a1a7;">&lt;&lt; " ===========================\n"</span>
        &lt;&lt; <span style="color: #50a14f;">"\n"</span>;


      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">PRINT TIMINGS</span>
      <span style="color: #a626a4;">if</span> (in.chrono)
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">pair</span>: <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono)
        LOG(1, <span style="color: #50a14f;">" "</span>) &lt;&lt; pair.first &lt;&lt; <span style="color: #50a14f;">" :: "</span>
                    &lt;&lt; pair.second.count()
                    &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::endl;

    }

    <span style="color: #a626a4;">const</span> <span style="color: #c18401;">ABCTuple</span> <span style="color: #8b4513;">abc</span> = isFakeTuple(i)
                       ? tuplesList[tuplesList.size() - 1]
                       : tuplesList[i]
                 , *<span style="color: #8b4513;">abcNext</span> = i == (tuplesList.size() - 1)
                            ? <span style="font-weight: bold; text-decoration: underline;">nullptr</span>
                            : &amp;tuplesList[i + 1]
                 ;

    WITH_CHRONO(<span style="color: #50a14f;">"with_rank"</span>,
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">" :it "</span> &lt;&lt; iteration
                &lt;&lt; <span style="color: #50a14f;">" :abc "</span> &lt;&lt; pretty_print(abc)
                &lt;&lt; <span style="color: #50a14f;">" :abcN "</span>
                &lt;&lt; (abcNext ? pretty_print(*abcNext) : <span style="color: #50a14f;">"None"</span>)
                &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
    )


    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">COMM FIRST DATABASE ================================================{{{1</span>
    <span style="color: #a626a4;">if</span> (i == 0) {
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__first__:first database ............ \n"</span>;
      <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">db</span> = communicateDatabase(abc, universe);
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__first__:first database communicated \n"</span>;
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__first__:first database io phase \n"</span>;
      doIOPhase(db);
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__first__:first database io phase DONE\n"</span>;
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__first__::::Unwrapping all slices for first database\n"</span>;
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">u</span>: unions) u-&gt;unwrapAll(abc);
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__first__::::Unwrapping slices for first database DONE\n"</span>;
      MPI_Barrier(universe);
    }

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">COMM NEXT DATABASE ================================================={{{1</span>
    <span style="color: #a626a4;">if</span> (abcNext) {
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__comm__:"</span> &lt;&lt; iteration &lt;&lt; <span style="color: #50a14f;">"th communicating database\n"</span>;
      WITH_CHRONO(<span style="color: #50a14f;">"db:comm"</span>,
        <span style="color: #a626a4;">const</span> <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">db</span> = communicateDatabase(*abcNext, universe);
      )
      WITH_CHRONO(<span style="color: #50a14f;">"db:io"</span>,
        doIOPhase(db);
      )
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__comm__:"</span> &lt;&lt;  iteration &lt;&lt; <span style="color: #50a14f;">"th database io phase DONE\n"</span>;
    }

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">COMPUTE DOUBLES ===================================================={{{1</span>
    OCD_Barrier(universe);
    <span style="color: #a626a4;">if</span> (<span style="font-weight: bold;">!</span>isFakeTuple(i)) {
      WITH_RANK &lt;&lt; iteration &lt;&lt; <span style="color: #50a14f;">"-th doubles\n"</span>;
      WITH_CHRONO(<span style="color: #50a14f;">"oneshot-unwrap"</span>,
      WITH_CHRONO(<span style="color: #50a14f;">"unwrap"</span>,
      WITH_CHRONO(<span style="color: #50a14f;">"unwrap:doubles"</span>,
        <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">u</span>: <span style="color: #a626a4;">decltype</span>(unions){&amp;abph, &amp;hhha, &amp;taphh, &amp;tabhh}) {
          u-&gt;unwrapAll(abc);
        }
      )))
      WITH_CHRONO(<span style="color: #50a14f;">"oneshot-doubles"</span>,
      WITH_CHRONO(<span style="color: #50a14f;">"doubles"</span>,
        doublesContribution( abc, (<span style="color: #c18401;">size_t</span>)No, (<span style="color: #c18401;">size_t</span>)Nv
                          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- VABCI</span>
                          , abph.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AB, abc)
                          , abph.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AC, abc)
                          , abph.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::BC, abc)
                          , abph.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::BA, abc)
                          , abph.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::CA, abc)
                          , abph.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::CB, abc)
                          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- VHHHA</span>
                          , hhha.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::A, abc)
                          , hhha.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::B, abc)
                          , hhha.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::C, abc)
                          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- TA</span>
                          , taphh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::A, abc)
                          , taphh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::B, abc)
                          , taphh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::C, abc)
                          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- TABIJ</span>
                          , tabhh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AB, abc)
                          , tabhh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AC, abc)
                          , tabhh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::BC, abc)
                          <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">-- TIJK</span>
                          , Tijk.data()
                          );
        WITH_RANK &lt;&lt; iteration &lt;&lt; <span style="color: #50a14f;">"-th doubles done\n"</span>;
      ))
    }

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">COMPUTE SINGLES =================================================== {{{1</span>
    OCD_Barrier(universe);
    <span style="color: #a626a4;">if</span> (<span style="font-weight: bold;">!</span>isFakeTuple(i)) {
      WITH_CHRONO(<span style="color: #50a14f;">"oneshot-unwrap"</span>,
      WITH_CHRONO(<span style="color: #50a14f;">"unwrap"</span>,
      WITH_CHRONO(<span style="color: #50a14f;">"unwrap:singles"</span>,
        abhh.unwrapAll(abc);
      )))
      WITH_CHRONO(<span style="color: #50a14f;">"reorder"</span>,
        <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">I</span>(0); I &lt; Zijk.size(); I++) Zijk[I] = Tijk[I];
      )
      WITH_CHRONO(<span style="color: #50a14f;">"singles"</span>,
        singlesContribution( No, Nv, abc
                          , Tai.data()
                          , abhh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AB, abc)
                          , abhh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::AC, abc)
                          , abhh.unwrapSlice(<span style="font-weight: bold; text-decoration: underline;">Slice</span>::BC, abc)
                          , Zijk.data());
      )
    }


    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">COMPUTE ENERGY ==================================================== {{{1</span>
    <span style="color: #a626a4;">if</span> (<span style="font-weight: bold;">!</span>isFakeTuple(i)) {
      <span style="color: #c18401;">double</span> <span style="color: #8b4513;">tupleEnergy</span>(0.);

      <span style="color: #c18401;">int</span> <span style="color: #8b4513;">distinct</span>(0);
      <span style="color: #a626a4;">if</span> (abc[0] == abc[1]) distinct++;
      <span style="color: #a626a4;">if</span> (abc[1] == abc[2]) distinct--;
      <span style="color: #a626a4;">const</span> <span style="color: #c18401;">double</span> <span style="color: #8b4513;">epsabc</span>(epsa[abc[0]] + epsa[abc[1]] + epsa[abc[2]]);

      WITH_CHRONO(<span style="color: #50a14f;">"energy"</span>,
        <span style="color: #a626a4;">if</span> ( distinct == 0)
          tupleEnergy = getEnergyDistinct(epsabc, epsi, Tijk, Zijk);
        <span style="color: #a626a4;">else</span>
          tupleEnergy = getEnergySame(epsabc, epsi, Tijk, Zijk);
      )

<span style="color: #e44649;">#if</span> <span style="color: #e44649;">defined</span>(HAVE_OCD) || <span style="color: #e44649;">defined</span>(ATRIP_PRINT_TUPLES)
      tupleEnergies[abc] = tupleEnergy;
<span style="color: #e44649;">#endif</span>

      energy += tupleEnergy;

    }

    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: remove this</span>
    <span style="color: #a626a4;">if</span> (isFakeTuple(i)) {
      <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">fake iterations should also unwrap whatever they got</span>
      WITH_RANK &lt;&lt; iteration
                &lt;&lt; <span style="color: #50a14f;">"th unwrapping because of fake in "</span>
                &lt;&lt; i &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">u</span>: unions) u-&gt;unwrapAll(abc);
    }

<span style="color: #e44649;">#ifdef</span> HAVE_OCD
    <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">u</span>: unions) {
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__dups__:"</span>
                &lt;&lt; iteration
                &lt;&lt; <span style="color: #50a14f;">"-th n"</span> &lt;&lt; u-&gt;name &lt;&lt; <span style="color: #50a14f;">" checking duplicates\n"</span>;
      u-&gt;checkForDuplicates();
    }
<span style="color: #e44649;">#endif</span>


    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">CLEANUP UNIONS ===================================================={{{1</span>
    OCD_Barrier(universe);
    <span style="color: #a626a4;">if</span> (abcNext) {
      WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__gc__:"</span> &lt;&lt; iteration &lt;&lt; <span style="color: #50a14f;">"-th cleaning up.......\n"</span>;
      <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">u</span>: unions) {

        u-&gt;unwrapAll(abc);
        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__gc__:n"</span> &lt;&lt; u-&gt;name  &lt;&lt; <span style="color: #50a14f;">" :it "</span> &lt;&lt; iteration
                  &lt;&lt; <span style="color: #50a14f;">" :abc "</span> &lt;&lt; pretty_print(abc)
                  &lt;&lt; <span style="color: #50a14f;">" :abcN "</span> &lt;&lt; pretty_print(*abcNext)
                  &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
        <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">slice</span>: u-&gt;slices)
          WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__gc__:guts:"</span> &lt;&lt; slice.info &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
        u-&gt;clearUnusedSlicesForNext(*abcNext);

        WITH_RANK &lt;&lt; <span style="color: #50a14f;">"__gc__: checking validity\n"</span>;

<span style="color: #e44649;">#ifdef</span> HAVE_OCD
        <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">check for validity of the slices</span>
        <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">type</span>: u-&gt;sliceTypes) {
          <span style="color: #a626a4;">auto</span> <span style="color: #8b4513;">tuple</span> = <span style="font-weight: bold; text-decoration: underline;">Slice</span>::subtupleBySlice(abc, type);
        <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span>&amp; <span style="color: #8b4513;">slice</span>: u-&gt;slices) {
          <span style="color: #a626a4;">if</span> ( slice.info.type == type
             &amp;&amp; slice.info.tuple == tuple
             &amp;&amp; slice.isDirectlyFetchable()
             ) {
            <span style="color: #a626a4;">if</span> (slice.info.state == <span style="font-weight: bold; text-decoration: underline;">Slice</span>::Dispatched)
              <span style="color: #a626a4;">throw</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::domain_error( <span style="color: #50a14f;">"This slice should not be undispatched! "</span>
                                     + pretty_print(slice.info));
          }
        }
        }
<span style="color: #e44649;">#endif</span>


      }
    }

      WITH_RANK &lt;&lt; iteration &lt;&lt; <span style="color: #50a14f;">"-th cleaning up....... DONE\n"</span>;

    <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[<span style="color: #50a14f;">"iterations"</span>].stop();
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">ITERATION END ====================================================={{{1</span>

  }
    <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">END OF MAIN LOOP</span>

  MPI_Barrier(universe);

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">PRINT TUPLES ========================================================={{{1</span>
<span style="color: #e44649;">#if</span> <span style="color: #e44649;">defined</span>(HAVE_OCD) || <span style="color: #e44649;">defined</span>(ATRIP_PRINT_TUPLES)
  LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"tuple energies"</span> &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  <span style="color: #a626a4;">for</span> (<span style="color: #c18401;">size_t</span> <span style="color: #8b4513;">i</span> = 0; i &lt; np; i++) {
    MPI_Barrier(universe);
    <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">pair</span>: tupleEnergies) {
      <span style="color: #a626a4;">if</span> (i == rank)
        <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; pair.first[0]
                  &lt;&lt; <span style="color: #50a14f;">" "</span> &lt;&lt; pair.first[1]
                  &lt;&lt; <span style="color: #50a14f;">" "</span> &lt;&lt; pair.first[2]
                  &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::setprecision(15) &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::setw(23)
                  &lt;&lt; <span style="color: #50a14f;">" tupleEnergy: "</span> &lt;&lt; pair.second
                  &lt;&lt; <span style="color: #50a14f;">"\n"</span>
                  ;
    }
  }
<span style="color: #e44649;">#endif</span>

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">COMMUNICATE THE ENERGIES ============================================={{{1</span>
  LOG(0,<span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"COMMUNICATING ENERGIES \n"</span>;
  <span style="color: #c18401;">double</span> <span style="color: #8b4513;">globalEnergy</span> = 0;
  MPI_Reduce(&amp;energy, &amp;globalEnergy, 1, MPI_DOUBLE, MPI_SUM, 0, universe);

  WITH_RANK &lt;&lt; <span style="color: #50a14f;">"local energy "</span> &lt;&lt; energy &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  LOG(0, <span style="color: #50a14f;">"Atrip"</span>) &lt;&lt; <span style="color: #50a14f;">"Energy: "</span>
    &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::setprecision(15) &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::setw(23)
    &lt;&lt; (- globalEnergy) &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::endl;

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">PRINT TIMINGS {{{1</span>
  <span style="color: #a626a4;">if</span> (in.chrono)
  <span style="color: #a626a4;">for</span> (<span style="color: #a626a4;">auto</span> <span style="color: #a626a4;">const</span>&amp; <span style="color: #8b4513;">pair</span>: <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono)
    LOG(0,<span style="color: #50a14f;">"atrip:chrono"</span>) &lt;&lt; pair.first &lt;&lt; <span style="color: #50a14f;">" "</span>
                          &lt;&lt; pair.second.count() &lt;&lt; <span style="font-weight: bold; text-decoration: underline;">std</span>::endl;


  LOG(0, <span style="color: #50a14f;">"atrip:flops(doubles)"</span>)
    &lt;&lt; nIterations * doublesFlops / <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[<span style="color: #50a14f;">"doubles"</span>].count() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;
  LOG(0, <span style="color: #50a14f;">"atrip:flops(iterations)"</span>)
    &lt;&lt; nIterations * doublesFlops / <span style="font-weight: bold; text-decoration: underline;">Atrip</span>::chrono[<span style="color: #50a14f;">"iterations"</span>].count() &lt;&lt; <span style="color: #50a14f;">"\n"</span>;

  <span style="color: #a0a1a7; font-weight: bold;">// </span><span style="color: #a0a1a7;">TODO: change the sign in  the getEnergy routines</span>
  <span style="color: #a626a4;">return</span> { - globalEnergy };

}
</pre>
</div>
</div>
</div>
</div>
